{"sessions":[{"id":"364","title":"CheapCast: ChromeCast without ChromeCast","location":"15","description":"Recently hitting the headlines Sebastian Mauer has developed CheapCast, emulating a ChromeCast Dongle on (almost) any Android Device. This involved setting up Service Discovery using SSDP, an HTTP- and WebSocket Server and an Activity to render the actual ChromeCast Receiver WebApp. What Sebastian found out is that the Android WebView is kind of limited and needed to be enhanced to be usable for realizing a ChromeCast Emulator. Sebastian will show that during the development of CheapCast the WebView was extended to support WebSockets using a special JavaScript Interface with bindings to Java Code.","subtype":"KEYNOTE","startTimestamp":1385368200,"webLink":"","presenterIds":["363"],"endTimestamp":1385370900},{"id":"366","title":"Google GLASS","location":"16","description":"Rob Rusher from On3 Inc will fly in from Denver and present the most interesting example of wearable computing to date: Google GLASS Come experience what it is like to use and develop applications for Google GLASS. This session will demonstrate the features and function of Google GLASS as well as introduce you to how to build Glassware. And “Yes!”, you can even try it out. ","subtype":"SESSION","startTimestamp":1385370900,"webLink":"","presenterIds":["365"],"endTimestamp":1385373600},{"id":"368","title":"Mobile Engineering @ SoundCloud","location":"15","description":"Building a mobile engineering team that delivers an engaging mobile experience to millions of users takes more than just technology. SoundCloud itself has learned a lot starting from its humble beginnings to where it is today by evolving its practices and tools as it scales both in terms of users and its engineering team. This talk will give an insight into how the SoundCloud mobile team delivers its mobile applications including the Agile process we use, our testing and continuous delivery practices and will touch on the architecture of the Android SoundCloud application.","subtype":"SESSION","startTimestamp":1385370900,"webLink":"","presenterIds":["367"],"endTimestamp":1385373600},{"id":"374","title":"Aiming for evolutionary innovation: Gesture Recognition","location":"17","description":"When Carmen-Elena and Gabriel established what they needed for developing the app, they found out about technologies such as Encog Artificial Intelligence Framework (an open source machine learning framework) and Hopfield Neural Network (an Artificial Neural Network). The gesture is captured using the phone’s accelerometer. The values of the accelerations are used for computing points coordinates in space. Interpolation is used so that the gesture made with the phone will be transformed in a continuous line in space describing (and drawing) this gesture. A pattern will be constructed based on the line that was drawn. The Hopfield Neural Network will use this pattern and learn the gesture so from now on it will be capable of identifying it. All of this also taking into account possible risks such as security issues or gesture misinterpretation.","subtype":"SESSION","startTimestamp":1385375400,"webLink":"","presenterIds":["372","371"],"endTimestamp":1385378100},{"id":"376","title":"Hardening your Android App","location":"15","description":"Android is to mobile what Windows is to desktop pc world; the biggest! Coupled with its open nature it’s the primary target for mobile attacker. As developers we need to ensure our apps protect users data and privacy. This is a talk for experienced Android developers to cover security best practices for app development. Focusing on encryption, key management, using SSL better and making it harder to pirate/repackage your app. Conclusion: This session will not just talk about the issues it will arm you with practical solutions and sample code to harden your app. Scott Alexander-Bown will also cover off some quick wins suitable of all levels of programmer and development teams.","subtype":"SESSION","startTimestamp":1385375400,"webLink":"","presenterIds":["369"],"endTimestamp":1385378100},{"id":"375","title":"The Indie Dev Survival Guide","location":"16","description":"Being an indie developer is not easy. This compilation of tricks presented by Raul Portales will help you survive as an indie on the complicated world of apps Raul discovered which parts of an app are usually underestimated that end up being key to the app success (mainly finding a good niche) or monetization (a.k.a. how to get over 1.5 million downloads and not cover the expenses). There are parts that we tend to forget and can hurt us later, like the amount of cheaters for games. Conclusion: Insights about what parts of the creation of an app are underestimated and some tips to reduce the huge risk of becoming indie.","subtype":"SESSION","startTimestamp":1385375400,"webLink":"","presenterIds":["370"],"endTimestamp":1385378100},{"id":"383","title":"Android+Raspberry Pi: a match made in heaven ","location":"15","description":"The Raspberry Pi is a cheap credit-card-sized single-board computer. Although it is a capable machine it is also blind. I.e. it has no sensors. This is where an Android device enters the stage. With a wide range of sensors it is a perfect extension to the Raspberry PI. Daan will give an introduction to the Raspberry Pi, discuss various means how sensor data from an Android phone can be fed into an Raspberry Pi, demonstrate these connections. Conclusion: Combining a Raspberry Pi with an Android device is a great way of extending the value of a Raspberry Pi.","subtype":"SESSION","startTimestamp":1385378100,"webLink":"","presenterIds":["378"],"endTimestamp":1385380800},{"id":"382","title":"PhoneGap specifics developing of Android applications","location":"16","description":"Technical details of the talk: The 300 millisecond lag between touch and click event on touchscreens Solution: generating a custom event instead of a click event. b) The problems of touching Solution: making the area of response bigger than the actual button. c) Optimization of DOM (document object model) of the app screen Solution: building single-page apps with changing content. To avoid lags: – Load the content of the page with Ajax queries; Background Yuiry Luchaninov: 2011- current time. Leading specialist in cross-platform development 2011 – Was in World Top 100 Android developers list 2009-2012. Android team lead","subtype":"SESSION","startTimestamp":1385378100,"webLink":"","presenterIds":["379"],"endTimestamp":1385380800},{"id":"381","title":"To Scrum or not to Scrum","location":"17","description":"Christine Karman has been developing Android apps since 2008. She had a twitter app in the play store on the day it opened. She has created Android apps for MobyPicture, Albert Heijn (Appie), BeleefRoutes, Post.nl and others. From her decades long experience in software development she has very specific ideas on how to properly develop good software. She applies these ideas in Android apps, which causes her to use tools like RoboGuice, Ormlite, Jackson and others. In the presentation, Christine will talk about when to use Scrum, and if not, how you can still use Scrum-like project management in smaller projects.","subtype":"SESSION","startTimestamp":1385378100,"webLink":"","presenterIds":["380"],"endTimestamp":1385380800},{"id":"356","title":"Sekai Phone & Cross-Platform development","location":"15","description":"Flying in from Japan, Kenichi is one of the most recognized Android guru’s from Japan. Amongst the 20+ applications developed by Kenichi he is the creator of ‘Sekai Phone’, a realtime translation phone service. This application won the 1st prize on Multi Screen UX competition 2013 and was displayed at Mobile World Congress 2013 and Google Developer Days in Japan. During his presentation Kenichi will show how he has used API’s such as Daydream and GCM and how the application enables speakers with different languages to communicate with each other. Kenichi will share best practices (Overview, Comparison, Cross-platform development) combined with a demonstration.","subtype":"KEYNOTE","startTimestamp":1385454600,"webLink":"","presenterIds":["352"],"endTimestamp":1385457300},{"id":"359","title":"The Cult of Culture","location":"15","description":"Culture is the buzz word of today’s tech community. It seems everyone is concerned with how to create a culture, how to maintain a culture, how to display their culture. What differentiates their culture from others. But there doesn’t seem to be much talk about what culture actually is. In his talk Github’s Yossef Mendelssohn talks about culture which means a lot of things to a lot of people. Culture is about what we want to improve, what we want to foster, what we want to encourage. Culture is about what we want to cultivate. Culture, really, is about what we want to define us. Culture is hard to contain in a pithy statement, even one as nice as “optimize for happiness”.","subtype":"SESSION","startTimestamp":1385457300,"webLink":"","presenterIds":["357"],"endTimestamp":1385460000}]}