{"sessions":[{"id":"366","title":"Google GLASS","location":"15","description":"Rob Rusher from On3 Inc will fly in from Denver and present the most interesting example of wearable computing to date: Google GLASS Come experience what it is like to use and develop applications for Google GLASS. This session will demonstrate the features and function of Google GLASS as well as introduce you to how to build Glassware. And “Yes!”, you can even try it out. ","subtype":"KEYNOTE","startTimestamp":1385368200,"webLink":"","presenterIds":["365"],"endTimestamp":1385370900},{"id":"385","title":"Design Matters","location":"17","description":"In his talk Filip Vucetic will talk about the importance of design and graphics in making successful app/game. Using concrete examples from his own apps Filip will explain how design helps make a successful app. Filip discovered how design affect kids and their attitudes toward particular apps. He found out many tips important for designers to take care of if they design apps for kids, some of tips are: – easy navigation – bright colors – importance of characters, etc… Another section will be based on importance of design inside the games. Other experiences will be shared in this presentation including how design may move borders and increase addiction of game users. ","subtype":"SESSION","startTimestamp":1385370900,"webLink":"","presenterIds":["384"],"endTimestamp":1385373600},{"id":"368","title":"Mobile Engineering @ SoundCloud","location":"15","description":"Building a mobile engineering team that delivers an engaging mobile experience to millions of users takes more than just technology. SoundCloud itself has learned a lot starting from its humble beginnings to where it is today by evolving its practices and tools as it scales both in terms of users and its engineering team. This talk will give an insight into how the SoundCloud mobile team delivers its mobile applications including the Agile process we use, our testing and continuous delivery practices and will touch on the architecture of the Android SoundCloud application.","subtype":"SESSION","startTimestamp":1385370900,"webLink":"","presenterIds":["367"],"endTimestamp":1385373600},{"id":"374","title":"Aiming for evolutionary innovation: Gesture Recognition","location":"17","description":"When Carmen-Elena and Gabriel established what they needed for developing the app, they found out about technologies such as Encog Artificial Intelligence Framework (an open source machine learning framework) and Hopfield Neural Network (an Artificial Neural Network). The gesture is captured using the phone’s accelerometer. The values of the accelerations are used for computing points coordinates in space. Interpolation is used so that the gesture made with the phone will be transformed in a continuous line in space describing (and drawing) this gesture. A pattern will be constructed based on the line that was drawn. The Hopfield Neural Network will use this pattern and learn the gesture so from now on it will be capable of identifying it. All of this also taking into account possible risks such as security issues or gesture misinterpretation.","subtype":"SESSION","startTimestamp":1385375400,"webLink":"","presenterIds":["372","371"],"endTimestamp":1385378100},{"id":"376","title":"Hardening your Android App","location":"15","description":"Android is to mobile what Windows is to desktop pc world; the biggest! Coupled with its open nature it’s the primary target for mobile attacker. As developers we need to ensure our apps protect users data and privacy. This is a talk for experienced Android developers to cover security best practices for app development. Focusing on encryption, key management, using SSL better and making it harder to pirate/repackage your app. Conclusion: This session will not just talk about the issues it will arm you with practical solutions and sample code to harden your app. Scott Alexander-Bown will also cover off some quick wins suitable of all levels of programmer and development teams.","subtype":"SESSION","startTimestamp":1385375400,"webLink":"","presenterIds":["369"],"endTimestamp":1385378100},{"id":"375","title":"The Indie Dev Survival Guide","location":"16","description":"Being an indie developer is not easy. This compilation of tricks presented by Raul Portales will help you survive as an indie on the complicated world of apps Raul discovered which parts of an app are usually underestimated that end up being key to the app success (mainly finding a good niche) or monetization (a.k.a. how to get over 1.5 million downloads and not cover the expenses). There are parts that we tend to forget and can hurt us later, like the amount of cheaters for games. Conclusion: Insights about what parts of the creation of an app are underestimated and some tips to reduce the huge risk of becoming indie.","subtype":"SESSION","startTimestamp":1385375400,"webLink":"","presenterIds":["370"],"endTimestamp":1385378100},{"id":"383","title":"Android+Raspberry Pi: a match made in heaven ","location":"15","description":"The Raspberry Pi is a cheap credit-card-sized single-board computer. Although it is a capable machine it is also blind. I.e. it has no sensors. This is where an Android device enters the stage. With a wide range of sensors it is a perfect extension to the Raspberry PI. Daan will give an introduction to the Raspberry Pi, discuss various means how sensor data from an Android phone can be fed into an Raspberry Pi, demonstrate these connections. Conclusion: Combining a Raspberry Pi with an Android device is a great way of extending the value of a Raspberry Pi.","subtype":"SESSION","startTimestamp":1385378100,"webLink":"","presenterIds":["378"],"endTimestamp":1385380800},{"id":"382","title":"PhoneGap specifics developing of Android applications","location":"16","description":"Technical details of the talk: The 300 millisecond lag between touch and click event on touchscreens Solution: generating a custom event instead of a click event. b) The problems of touching Solution: making the area of response bigger than the actual button. c) Optimization of DOM (document object model) of the app screen Solution: building single-page apps with changing content. To avoid lags: – Load the content of the page with Ajax queries; Background Yuiry Luchaninov: 2011- current time. Leading specialist in cross-platform development 2011 – Was in World Top 100 Android developers list 2009-2012. Android team lead","subtype":"SESSION","startTimestamp":1385378100,"webLink":"","presenterIds":["379"],"endTimestamp":1385380800},{"id":"381","title":"To Scrum or not to Scrum","location":"17","description":"Christine Karman has been developing Android apps since 2008. She had a twitter app in the play store on the day it opened. She has created Android apps for MobyPicture, Albert Heijn (Appie), BeleefRoutes, Post.nl and others. From her decades long experience in software development she has very specific ideas on how to properly develop good software. She applies these ideas in Android apps, which causes her to use tools like RoboGuice, Ormlite, Jackson and others. In the presentation, Christine will talk about when to use Scrum, and if not, how you can still use Scrum-like project management in smaller projects.","subtype":"SESSION","startTimestamp":1385378100,"webLink":"","presenterIds":["380"],"endTimestamp":1385380800},{"id":"389","title":"Doing the open source thingy","location":"17","description":"Many developers have used an open source library one way or the other when creating Android applications. But what does it mean “an open source library”, and can your library become open source? And at least as important, whats in it for me? Wiebe Elsinga is technical Lead at ItudeMobile. He has a long experience in software development but is mainly focused on the development of mobile applications, and is continuously seeking quality improvements within the development process of mobile applications. In this talk Wiebe will take a deep dive into the open source world, and provide practical information, the approach and experiences of going open source.","subtype":"SESSION","startTimestamp":1385384400,"webLink":"","presenterIds":["387"],"endTimestamp":1385387100},{"id":"390","title":"The App Marketing Challenge","location":"15","description":"Android is the world’s most used mobile OS with the number of apps growing at an incredible rate. Thousands of new apps are added daily, all trying to get a piece of the pie and turn into the next Angry Birds. But what is really the best strategy to pursue to consistently generate revenue in this eco system? In this talk StartApp’s Omri Barnes will review the challenges Android developers have on a daily basis when it comes to how to market their app, how to retain their users and how to make money out of it.","subtype":"SESSION","startTimestamp":1385384400,"webLink":"","presenterIds":["386"],"endTimestamp":1385387100},{"id":"395","title":"Coding your app for sponsoring","location":"16","description":"Boris v. Lüttwitz from German start-up apponsor will do a live coding session with the apponsor SDK, a new way to monetize your app via sponsoring. apponsor offers you a new and simple way to monetize your app. You publish your app with the apponsor SDK extended app and offer it to users free of charge and free of advertising. When starting the app apponsor determines the optimal sponsor for your app and displays an invitation to register for the newsletter of the sponsor to unlock the app. The sponsor pays for each incoming newsletter-registration a commission of up to 0.40 euros in full to the app developer. apponsor receives its commission directly from the sponsor. You decide how to use apponsor. You can apply apponsor for the use of your application, then the user can operate the app after a successful newsletter registration. Alternatively, you can also enable the activation of other levels/features of your app.","subtype":"SESSION","startTimestamp":1385387100,"webLink":"","presenterIds":["394"],"endTimestamp":1385389800},{"id":"396","title":"Having fun with Location","location":"17","description":"Antoon Uijtdehaag is a developer evangelist with Esri. Esri promotes The Location Platform for Apps, but most import which lessons have we learned and what capabilities are there to have some fun. Findings: Is consumer smartphone GPS good enough? What strategies apply to prevent running out of battery juice. Add location capabilities to your app. Raise some GeoTrigger events.","subtype":"SESSION","startTimestamp":1385387100,"webLink":"","presenterIds":["393"],"endTimestamp":1385389800},{"id":"397","title":"Mobile advertising","location":"15","description":"Flying in from the Google office in Dublin will be Cüneyt Ünar, mobile partnership manager at Google. In this talk Cüneyt will give you an overview and introduction to the in-app advertising business. Now that mobile advertising is maturing we will learn the mobile app ecosystem relates to the advertising around it. Important facts about current mobile ad formats will be presented and the newest technology will be shown (e.g. implementation of technology with DFP). Finally Cüneyt will show us the best practices around In-app purchases which will provide valuable insights into how to monetize Android apps.","subtype":"SESSION","startTimestamp":1385387100,"webLink":"","presenterIds":["392"],"endTimestamp":1385389800},{"id":"356","title":"Sekai Phone & Cross-Platform development","location":"15","description":"Flying in from Japan, Kenichi is one of the most recognized Android guru’s from Japan. Amongst the 20+ applications developed by Kenichi he is the creator of ‘Sekai Phone’, a realtime translation phone service. This application won the 1st prize on Multi Screen UX competition 2013 and was displayed at Mobile World Congress 2013 and Google Developer Days in Japan. During his presentation Kenichi will show how he has used API’s such as Daydream and GCM and how the application enables speakers with different languages to communicate with each other. Kenichi will share best practices (Overview, Comparison, Cross-platform development) combined with a demonstration.","subtype":"KEYNOTE","startTimestamp":1385454600,"webLink":"","presenterIds":["352"],"endTimestamp":1385457300},{"id":"359","title":"The Cult of Culture","location":"15","description":"Culture is the buzz word of today’s tech community. It seems everyone is concerned with how to create a culture, how to maintain a culture, how to display their culture. What differentiates their culture from others. But there doesn’t seem to be much talk about what culture actually is. In his talk Github’s Yossef Mendelssohn talks about culture which means a lot of things to a lot of people. Culture is about what we want to improve, what we want to foster, what we want to encourage. Culture is about what we want to cultivate. Culture, really, is about what we want to define us. Culture is hard to contain in a pithy statement, even one as nice as “optimize for happiness”.","subtype":"SESSION","startTimestamp":1385457300,"webLink":"","presenterIds":["357"],"endTimestamp":1385460000},{"id":"404","title":"Authentication for Droids","location":"15","description":"This talk is going to shed some light on different techniques that help to authenticate users in your application via methods such as Basic Authentication and more advanced technologies like OAuth 2.0 and OpenID Connect. Best practices will be presented and (dis-)advantages are going to be discussed. Choosing the right identity provider (like Facebook, Twitter, PayPal or Google Plus) can be difficult and there are different scenarios where it makes more or less sense to implement them. After leaving this session, the user will have a broad overview of this topic and should be able to provide the users of their app with a nice experience. In short Tim will tell us why it is important to choose the right identity provider and to understand the implementation techniques used. By using OAuth 2.0 or OpenID Connect your applications user experience can be improved a lot while not being a too big hassle to implement.","subtype":"SESSION","startTimestamp":1385461800,"webLink":"","presenterIds":["398"],"endTimestamp":1385464500},{"id":"403","title":"Desktop, mobile & hybrid, and the tools to rule them all","location":"17","description":"This talk aspires to cover a broad range of development topics, such as: – JavaScript editing and debugging – Using JavaScript frameworks such as AngularJS, Knockout.js and others – Visual editing of CSS styles following Responsive web design techniques – Testing and debugging on various target browsers and mobile devices – Hybrid application development for Android and iPhone using the PhoneGap framework – Native Android development – Using CSS preprocessors such as SASS and LESS – JavaScript testing and test frameworks – Troubleshooting client-server communication We will use an integrated development tool that supports all of the above.","subtype":"SESSION","startTimestamp":1385461800,"webLink":"","presenterIds":["399"],"endTimestamp":1385464500},{"id":"402","title":"Leveraging mobile development ecosystem: operator’s perspective","location":"16","description":"Turkcell’s Gorkem Cetin will discuss how the biggest mobile operator in Turkey and #3 in Europe, has started a mobile development and training initiative. Combined with a portal, a backend to help developers support their applications and a push notification infrastructure, mobile developers are now able to fast-forward with their projects in 3 leading mobile operating systems. Data will be presented from the platform which saw a considerable interest from mobile developers, individuals and software development companies. After launching, portal had 100.000 page views, 25.000 visitors and 1700 subscribed memberships in one day. Main driving factor for this was training documentation (1200+ pages), sample code for training purposes (13.000 SLOC) and lack of mobile development related initiatives in the region.","subtype":"SESSION","startTimestamp":1385461800,"webLink":"","presenterIds":["400"],"endTimestamp":1385464500},{"id":"409","title":"Best Practices to develop for different Android Device Classifications","location":"15","description":"This Session will give a best practices from the Immobilienscout24 Development for the different Android device classifications. During this presentation you can experience the learnings, which the presenter got during development of the ImmobilienScout 24 Android application. The presentation doesn’t cover Design, UX or Fragments, but it gives an introduction and samples of using different resources, in special layouts. These folders can be used for filtering specific configurations, referencing other resources and using layout aliases. This session aims at people with knowledge of coding for Android. Conclusion: The developers should loose their fear of developing for different screensizes in one application.","subtype":"SESSION","startTimestamp":1385464500,"webLink":"","presenterIds":["407"],"endTimestamp":1385467200},{"id":"410","title":"How to control electronic devices with Arduino & Android","location":"17","description":"Android devices can be used to control a wide array of electronic devices, which can be cheaply prototyped using Arduino. In this talk Michael will show how to assemble a simple device which will talk to Android. The Android SDK gives developers access to USB ports, both in master & slave mode, Bluetooth, NFC and WiFi radios which gives many different means, both wired and wireless to talk to our device. Using Arduino boards equipped with USB Accessory or Bluetooth radio we can make our own car docks, phone-controlled window blindfolds or even connect to our car and read various information from it, the possibilities are endless. Android itself has many different sensors, from accelerometer to magnetometer, but with Arduino, we can use external sensors placed wherever we want to and control them right from our Android device.","subtype":"SESSION","startTimestamp":1385464500,"webLink":"","presenterIds":["406"],"endTimestamp":1385467200},{"id":"411","title":"Using Firebase For Syncing Data On Android And The Web","location":"16","description":"Firebase is an interesting way of storing and syncing data between Android devices and other platforms. This talk gives you an insight of how to incorporate it into your apps. Saving data on Android can be a tedious business. Normally, you must decide where and how you want to persist your data: either on the handset or writing online to some server database Getting information about data changed on the server needs a lot of boilerplate code, data pushing and so on. Syncing data from local storage (file, sqlite) to a server is difficult unless your rely on commercial solutions like Sybase SQL Anywhere (by SAP) doing this in the background for you.","subtype":"SESSION","startTimestamp":1385464500,"webLink":"","presenterIds":["405"],"endTimestamp":1385467200},{"id":"417","title":"Android Architectures and Clean Code","location":"17","description":"Working at Novoda, during last year Frankie has started working on a series of huge applications with many features and increasing complexity. Bad design decision or code sloppiness that can be partially tolerated in smaller applications was completely out of the picture given the implication on the overall architecture. With several developers working on the same codebase enforcing good practices is the only way to survive. Applying the principles of Software Craftsmanship, TDD and Continuous Refactoring the application has grown to almost 50.000 lines of code while still having a coherent style all over the codebase.","subtype":"SESSION","startTimestamp":1385470800,"webLink":"","presenterIds":["413"],"endTimestamp":1385473500},{"id":"416","title":"Dependency injection on Android","location":"16","description":"In this talk Joan Puig Sanz will show that by using dependency injection one can save time writing code and make it way more friendly and maintainable for other developers. For instance finding views, creating singletons, fragments, providers, etc. There are a few frameworks to work with dependency injection, like RoboJuice or Dagger and each one with its own good and bad things. Conclusion: Dependency injection creates a way to work faster and in a more solid way. So the developer can focus more on the code that will add a plus value and of course, having more fun :)","subtype":"SESSION","startTimestamp":1385470800,"webLink":"","presenterIds":["414"],"endTimestamp":1385473500},{"id":"418","title":"The elegance of functional testing using Calabash","location":"15","description":"Continuously testing your applications is important to maintain the quality and to make sure problems do not occur after making changes to the applications. There are various frameworks out in the open that can help you create functional tests for your mobile applications. With many of these frameworks you need to have technical knowledge to create your functional tests. An exception to this rule is Calabash. In his talk Ali will show that this framework allows both technical and a- technical people to elegantly create functional tests for Android and iOS using natural language.","subtype":"SESSION","startTimestamp":1385470800,"webLink":"","presenterIds":["412"],"endTimestamp":1385473500},{"id":"424","title":"Gradle and the beauty of the command line","location":"17","description":"David Gonzalez will explain his experience and propose best practices learned from using Gradle as the build system for production environment applications and libraries. By developing the new application for ARTE (www.arte.tv) David gained knowledge in Gradle and how to properly build, test and release applications and libraries using this build system. David will show that Gradle is not the perfect build system yet but it will be. There are benefits and downsides over other build systems, developers will get the knowledge of what was learned using Gradle over the last months.","subtype":"SESSION","startTimestamp":1385473500,"webLink":"","presenterIds":["420"],"endTimestamp":1385476200},{"id":"423","title":"Motorola solutions: RhoMobile Suite","location":"16","description":"Today enterprises are looking to add to their IT infrastructure a standard module for “Mobility Solutions”. In his talk Pietro Maggi will showcase a solution where it’s possible to build enterprise application using standard web technology. In this talk Pietro will show how to use the RhoMobile Suite (the RhoElements client framework, the RhoConnect sync server and the RhoStudio IDE) to write native apps for all major mobile OSes and Android in particular. In addition to letting you use your web skills (HTML/CSS/JavaScript) to write native apps, RhoMobile Suite also enables you to use software development approaches like Model View Controller pattern, an Object Relational Manager, synchronization server and a full- featured IDE.","subtype":"SESSION","startTimestamp":1385473500,"webLink":"","presenterIds":["421"],"endTimestamp":1385476200},{"id":"425","title":"Using user location in your android application","location":"15","description":"Location is an awesome but difficult to master concept within android. The possibilities are endless so to provide the best experience for the user you need to know how stuff works. There are many use-cases of how you can use location in your application (foursquare, navigation, runkeeper) and all of those require different techniques to both receive accurate locations of the user without draining to much of their battery. Finishing it off with an overview of the google map services from the google play services SDK and how to use the location on a map or in the background. All of the above will be illustrated with example code and screenshots, some of them from a (by then) application available in the play store.","subtype":"SESSION","startTimestamp":1385473500,"webLink":"","presenterIds":["419"],"endTimestamp":1385476200},{"id":"428","title":"Android Security Threats – Past, Present, and Future.","location":"15","description":"The rapid evolution of mobile technology has provided a fertile ground for malicious actors to develop and execute new methods and tactics for sophisticated digital criminal campaigns. As the Android platform gains a larger user base, attackers have been observed taking advantage the influx of inexperienced users through backdoored applications and new vectors of client side exploitation. Attacks against poorly developed API’s have also been observed, leading to sizeable breaches of confidential user data. This talk will focus on the exploitation of HTML5 functionalities for client side attacks, exploitation of backend API’s, and proper methods of secure Android application development. Furthermore, the presentation will examine Android exploitation techniques that provide an overview of malicious campaign methodologies.","subtype":"KEYNOTE","startTimestamp":1385476200,"webLink":"","presenterIds":["427"],"endTimestamp":1385478900}]}