{"sessions":[{"id":"503","title":"Augmented-smartphone: using the Android device beyond the display to interact with the surroundings","location":"18","description":"While augmented-reality aims to enrich reality with data coming from the phone, the rich set of interfaces and sensor the equips modern device open new possibilities to enhance user experience automating tedious processes, bringing security and new business opportunities. The talk shows how to use latest API, Bluetooth classic and Bluetooth Low Energy, NFC and other technologies to empower user experience on real world.","subtype":"SESSION","startTimestamp":1391676600,"webLink":"","presenterIds":["495"],"endTimestamp":1391678400},{"id":"504","title":"Gradle Build System","location":"20","description":"Introductory talk about using the new Gradle build system for developing Android apps. Integration in Android Studio and Eclipse. Migration from Eclipse -> Android Studio. Using Android Studio with Eclipse managed projects, etc...","subtype":"SESSION","startTimestamp":1391676600,"webLink":"","presenterIds":["487"],"endTimestamp":1391678400},{"id":"507","title":"Reverse Engineering, Pentesting e Hardening di Applicazioni Android ","location":"21","description":"Ciao sono Marco, sono Mobile Security Researcher in viaForensics che si occupa soprattutto di Android e iOS, come parte del mio lavoro faccio hacking sulle app mobile e aiuto gli sviluppatori a sistemarle.Il mio lavoro su queste app punta a simulare quello che potrebbe fare un attaccante alla nostra applicazione, ricercando e sfruttando vulnerabilità per eseguire azioni non autorizzate o trarne vantaggio a scapito degli utenti, ovviamente senza il loro consenso. Una volta individuate le possibili vulnerabilità, vengono comunicate e vengono date delle raccomandazioni ai developers su come rimediarle e sviluppare applicazioni più sicure.Per queste ragioni, vorrei esporre in questo talk alcune metodologie che vengono utilizzate per effettuare queste analisi in modo molto pratico e cercare di mostrare agli sviluppatori quali sono gli errori di sviluppo più comuni che portano a vulnerabilità, come evitarli con alcune best practices e progetti o librerie open source che possono aiutarci in questa direzione.Il talk avrà una particolare attenzione per i developers nell’audience, sperando che ne possano trarre buoni spunti e linee guida per sviluppare applicazioni più sicure, ma anche per persone che vogliono avvicinarsi al mondo del reverse engineering, utilizzando questi strumenti per capire come sono implementate certe features, effettuare modding di applicazioni e rom Android, o semplicemente anche a chi vuole avvicinarsi al mondo della sicurezza mobile.","subtype":"SESSION","startTimestamp":1391676600,"webLink":"","presenterIds":["506"],"endTimestamp":1391678400},{"id":"508","title":"Make more money with your Android apps","location":"18","description":"The new BlackBerry Runtime for Android apps, integrated into the new BlackBerry 10 smartphones, offers significantly increased compatibility and allow customers to run Android apps on their smartphones easily and seamlessly. Android devs are encouraged to take advantage of the new runtime and port their app to the BlackBerry 10 platform so they can expand their user base and revenue opportunities. The presentation highlights the opportunities for Android developers who want to leverage the BlackBerry 10 platform and describes how to publish their Android apps to the BlackBerry World storefront.","subtype":"SESSION","startTimestamp":1391679000,"webLink":"","presenterIds":["484"],"endTimestamp":1391681400},{"id":"509","title":"One code to play'em all","location":"20","description":"Nowadays a mobile app has to run on several devices with different screen sizes (unlike the apple devices). From the very-small smartphone to the biggest tablet in the world, optimizing apps for multiple devices and different kind of users is crucial to offer a great user experience. It's also important to provide a native Look&Feel to each application (not mandatory, but recommended) in order to avoid users getting confused when use your apps (confirmation and abort button's place, Holo theme etc); in this part I'll show some apps and their transformation and improvement after applying the right design principles. The talk will end with a brush up on basic design principles directly from the official documentation and some good useful resources for graphic designers. Briefly: - Making apps that works on every screen resolution (overview) - Introducing Fragments - Make fragments compatible with old android versions - Demo app - Android Design: the Holo Theme - Comparison between Holo and non-Holo apps - Android design principles overview","subtype":"SESSION","startTimestamp":1391679000,"webLink":"","presenterIds":["496"],"endTimestamp":1391681400},{"id":"512","title":"Robotito Verde Chactado aka Mod Your Device","location":"21","description":"Android devices mounts ROMs that sometimes differ in many aspects from the official version and sometimes some parties are completely closed. This problem get you to search methods to figure out how to go to on in cases where you want to build an ad-hoc version of the system for your device. We will see how to intervene in build files, settings values and in the boot of the operating system and how you can control the device and its applications by installing new utilities that you could compile yourself in complete autonomy and understand the usefulness of the adb commands. When we're ready with all the customizations we can cook our ROM.","subtype":"SESSION","startTimestamp":1391679000,"webLink":"","presenterIds":["511"],"endTimestamp":1391681400},{"id":"513","title":"Daily Mail Android App - Applicazioni con moltissimi contenuti per milioni di utenti","location":"18","description":"L'applicazione della rivista DailyMail permette di visualizzare, anche in modalita' offiline, una grossa quantita' di informazioni tra cui moltissime immagini. In questo talk si vogliono descrivere le problematiche incontrate e le soluzioni adottate per raggiungere, con successo, il maggior numero di utenti.","subtype":"SESSION","startTimestamp":1391683200,"webLink":"","presenterIds":["488"],"endTimestamp":1391685600},{"id":"514","title":"From Android App to Killer App: How to Reach the Million-Downloads Milestone","location":"20","description":"What makes an Android app a killer app? How do you make your own project scale from a few dozens to millions of users? How do you engage users all over the world? How do you put a spotlight on your app, so anyone can discover it? An Android app is not just what the app does, and it's not just how you developed it. It's about how you build an ecosystem around it. It's about how do you improve your app to accommodate it to users, and how you make users comfortable with your app. It's about how you listen to your customers to make it awesome. It's going the extra-mile and transform an app from cool to magic. In this talk we will discuss some strategies to improve the impact of Android apps, from multiple points of view: from app development to code optimization, from basic graphical assets to awesome eye-candy UI, from catchy features to user deep engagement. We will see how using the latest features compares to backward compatibility regarding user impact, and how monetization and social marketing strategies can help an Android app reach that million-downloads milestone.","subtype":"SESSION","startTimestamp":1391683200,"webLink":"","presenterIds":["486"],"endTimestamp":1391685600},{"id":"516","title":"Testing Android Application","location":"21","description":"Most of Android applications have bugs. Why not discover them in pre-release? Unit and Functional testing permit finding some of the bugs and correcting them before publishing the application.We analyze why testing application and how we test it to provide bug discovery thus releasing stable applications.","subtype":"SESSION","startTimestamp":1391683200,"webLink":"","presenterIds":["515"],"endTimestamp":1391685600},{"id":"518","title":"Handy extensions to maps on Android","location":"20","description":"The appearance of a new Google Maps Android API over a year ago sparked a lot of emotion. It is clearly a big step forward, but you need to be warned when making it. You may easily slip. Fortunatelly Google developers constantly help us by fixing bugs and adding new features to the API. At the same time open-source community didn't sleep either. A couple of useful libraries were created, which help use with the most common tasks related to displaying things on a map. We will talk about what's now possible and where are the limits of their use.","subtype":"SESSION","startTimestamp":1391686200,"webLink":"","presenterIds":["485"],"endTimestamp":1391688000},{"id":"521","title":"The elegance of functional testing using Calabash","location":"21","description":"Continuously testing your applications is important to maintain the quality and to make sure problems don’t occur after making changes to the applications. There are various frameworks out in the open that can help you create functional tests for your mobile applications. With many of these frameworks you need to have technical knowledge to create your functional tests. An exception to this rule is Calabash. This framework allows both technical and a-technical people to elegantly create functional tests for Android and iOS using natural language. Ali will be talking about Calabash and how easy it will become to create functional tests once entering the world of Calabash.","subtype":"SESSION","startTimestamp":1391686200,"webLink":"","presenterIds":["520"],"endTimestamp":1391688000},{"id":"517","title":"You must and you can: Android UI Patterns","location":"18","description":"Android Official Guidelines and Android UI Patterns in daily work. To build a beatiful app MUST I follow the guidelines?","subtype":"SESSION","startTimestamp":1391686200,"webLink":"","presenterIds":["480"],"endTimestamp":1391688000},{"id":"529","title":"Android applications are inspired by Multi-Agent Systems","location":"19","description":"(a.k.a. What does teaching technologies at university mean? How to teach Android?) Every time I face a new course, especially when it has a strong technological content, I wonder which is the best way to teach it because while I am convinced that teachers should be up to date about technologies, I am not convinced that teachers should teach technologies. The key aspect, however, is not only on the solution of a problem but also in the problem-posing. Technologies as part of the problem-posing and solving pedagogical methodology. A fundamental part of the learning process is the discussion of the problem itself and the generalization of the discovered process towards a solution. In other words, a key aspect of teaching is to create \"connections\", \"links\" among previous technologies and methodologies, even better if they are from unrelated problems. Event-driven programming, the success of OO technologies for realizing frameworks, the achievement of software reuse are just few examples of topics, which are involved by teaching Android. So, it should not surprise that I think it is important to teach how strong the relation is between the organization of a Multi-Agent Systems, and the way in which an Android application works. Especially in order to achieve a better software reuse. In my opinion, this is a good way of teaching technologies and of overcoming their premature departure.","subtype":"SESSION","startTimestamp":1391691600,"webLink":"","presenterIds":["528"],"endTimestamp":1391694000},{"id":"525","title":"Google Glass 4 LIS: la wearable technology per le disabilità","location":"18","description":"Nel mondo dell’Hi-Tech si cerca continuamente “The next big thing”, quel device o quell’idea in grado di rivoluzionare il mondo così come lo conosciamo, un po’ come è stato per i DVD per l’home video o l’arrivo dell’iPhone, che ha segnato l’epoca degli smartphone. I Google Glass potrebbero essere “The next big thing”. Rokivo Inc, società specializzata in UI e UX, è stata inclusa ad aprile del 2013 nel progetto Google Glass Explorer, destinato a sole società americane, per iniziare a sviluppare il device, ancora oggi in fase di prototipo. Rokivo Inc, insieme alla consociata Vidiemme Consulting di Milano, sta lavorando su diverse aree tra cui mobile banking, connected car, chirurgia, largo consumo, didattica, entertainment, e disabilità. Proprio in quest'area è stato avviato il progetto Google Glass4LIS, un'applicazione per consentire un'esperienza completa di visita museale ai sordi. Il progetto è sviluppato in collaborazione con ENS, Ente Nazionale Sordi, con il Politecnico di Torino e l'Università di Torino, e con il Museo Egizio. lingua: italiano (se devo in inglese va bene)","subtype":"SESSION","startTimestamp":1391691600,"webLink":"","presenterIds":["524"],"endTimestamp":1391694000},{"id":"527","title":"Release the Kraken! UDOO porta Android dove nessuno smartphone potrebbe arrivare.","location":"21","description":"E' stato prigioniero nelle nostre tasche per troppo tempo ma la rivoluzione dei makers ha dato il via allo sviluppo di nuove piattaforme hardware ed ora Android è in grado di sprigionare tutte le proprie potenzialità. UDOO è tra queste piattaforme e possiede tutti i requisiti per trascinare Android fuori dai soliti device ed interagire con l’Internet delle Cose.Per chi è già uno sviluppatore Android o per chi si affaccia in questo mondo, oggi esiste la possibilità di creare e diffondere una varietà di applicazioni in grado di arrivare dove prima non era possibile.","subtype":"SESSION","startTimestamp":1391691600,"webLink":"","presenterIds":["526"],"endTimestamp":1391694000},{"id":"531","title":"WORKSHOP: Android Security - il Key Management","location":"22","description":"Il workshop tratterà alcuni aspetti legati alle problematiche di sicurezza riguardanti il “Key Management” per le applicazioni Android. Nella prima parte dell’intervento verranno analizzati diversi scenari in cui r kmisulta necessario proteggere i dati utilizzati da un'applicazione; seguirà un introduzione teorica sulle possibili tecniche disponibili per la protezione dei dati mediante crittosistemi a chiave simmetrica e asimmetrica. Si proseguirà poi con la descrizione e l'implementazione di alcune tecniche di Key Management utilizzate per la gestione sicura delle chiavi di cifratura per algoritmi simmetrici, tenendo in considerazione l’eventuale interazione con l'utente finale. Nella parte conclusiva si analizzeranno gli strumenti messi a disposizione da Android per la gestione delle chiavi private e dei rispettivi certificati utilizzati in algoritmi asimmetrici, come il KeyChain ed il nuovo “Android Key Store”, disponibile dalla versione 4.3. Il workshop si svolgerà alternando sessioni teoriche a sessioni pratiche di coding, durante le quali i partecipanti potranno utilizzare e mettere in pratica i concetti esposti durante l’intervento.","subtype":"SESSION","startTimestamp":1391691600,"webLink":"","presenterIds":["530"],"endTimestamp":1391694000},{"id":"534","title":"Android chat app in the cloud","location":"18","description":"How to create an Android app that accesses to RESTful APIs, manages push notifications and exchanges arbitrary data among different devices. In less than 1 hours. Difficulty: advanced","subtype":"SESSION","startTimestamp":1391694600,"webLink":"","presenterIds":["437"],"endTimestamp":1391697000},{"id":"535","title":"Choosing a back end for your mobile app","location":"21","description":"Although usually unnoticed by the final users, the backend is an important piece in the context of mobile application. In the past, building a backend meant renting some hardware or virtual machine, setting up the operative system, configuring the server, database, storage and writing the backend logic. Nowadays, great services are spreading, that allow to quickly setup a backend. I am going to provide an overview of the services which allow developers to integrate their mobile applications with backend functionalities and I am going to illustrate the features of BaasBox, an open source backend, and its Android SDK. BaasBox is a tool that aims at being fully integrated with the best practices of Android platform, easing the development of mobile apps without forcing you to change the standard approach to the development of Android native clients.","subtype":"SESSION","startTimestamp":1391694600,"webLink":"","presenterIds":["477"],"endTimestamp":1391697000},{"id":"537","title":"Problematiche di sicurezza nel mondo mobile/Android","location":"19","description":"La presentazione ha l'obiettivo di illustrare le principali problematiche di sicurezza relative al mondo mobile con particolare riferimento alla piattaforma Android. Nel corso dell'intervento vedremo come il mondo del cybercrime si stia spostando (e evolvendo) rapidapemente verso i dispositivi mobili, faremo un overview generale capendo quali sono le problematiche e i principali vettori di attacco del mondo mobile. In particolare andremo ad approfondire le peculiarità dell'ecosistema Android viste dalla prospettiva di un agente di minaccia, supportati da esempi pratici di analisi di alcune delle vulnerabilità più note e interessanti di questi ultimi anni.","subtype":"SESSION","startTimestamp":1391694600,"webLink":"","presenterIds":["536"],"endTimestamp":1391697000},{"id":"532","title":"WORKSHOP: Android Security - il Key Management","location":"22","description":"Il workshop tratterà alcuni aspetti legati alle problematiche di sicurezza riguardanti il “Key Management” per le applicazioni Android. Nella prima parte dell’intervento verranno analizzati diversi scenari in cui r kmisulta necessario proteggere i dati utilizzati da un'applicazione; seguirà un introduzione teorica sulle possibili tecniche disponibili per la protezione dei dati mediante crittosistemi a chiave simmetrica e asimmetrica. Si proseguirà poi con la descrizione e l'implementazione di alcune tecniche di Key Management utilizzate per la gestione sicura delle chiavi di cifratura per algoritmi simmetrici, tenendo in considerazione l’eventuale interazione con l'utente finale. Nella parte conclusiva si analizzeranno gli strumenti messi a disposizione da Android per la gestione delle chiavi private e dei rispettivi certificati utilizzati in algoritmi asimmetrici, come il KeyChain ed il nuovo “Android Key Store”, disponibile dalla versione 4.3. Il workshop si svolgerà alternando sessioni teoriche a sessioni pratiche di coding, durante le quali i partecipanti potranno utilizzare e mettere in pratica i concetti esposti durante l’intervento.","subtype":"SESSION","startTimestamp":1391694600,"webLink":"","presenterIds":["530"],"endTimestamp":1391697000},{"id":"539","title":"Amazon Services: Advantages","location":"18","description":"ENG: Amazon always supports app developers. Amazon will attend Droidcon Italy (6-7th Feb) with the aim to show all the services and the advantages of App-Shop Amazon for Android and Kindle Fire. A special focus will be dedicated to best practices around monetization and featuring opportunities, which are distinctive marks of App-Shop Amazon. At the end of the event, developers will learn the best practices on how to maximize revenues through Amazon and get details on Appstore Developer Select program, recently launched in the US. The Appstore Developer Select offers featuring placements, Ad impressions and AWS credits thus giving to indie developers, with apps optimized for Kindle Fire HD and HDX, the opportunity of enhanced merchandising benefits and visibility. ITA: Amazon, che da sempre ha a cuore gli sviluppatori, parteciperà a Droidcon Italy per presentare App-Shop Amazon per Android e la famiglia Kindle Fire, illustrandone i vantaggi ed i servizi. Un focus particolare sarà riservato alla possibilità di monetizzazione e di visibilità offerte agli sviluppatori. Verranno presentate le best practices sulla monetizzazione e il programma Appstore Developer Select lanciato negli USA, che offre \"featuring placements\", Ad impressions e crediti AWS alle app e ai giochi ottimizzati per Kindle Fire HD e HDX, dando così la possibilità agli sviluppatori indipendenti di essere conosciuti dal pubblico. Descrizione di Amazon Amazon.com, Inc. (NASDAQ: AMZN), a Fortune 500 company based in Seattle, opened on the World Wide Web in July 1995 and today offers Earth’s Biggest Selection. Amazon.com, Inc. seeks to be Earth’s most customer-centric company, where customers can find and discover anything they might want to buy online, and endeavors to offer its customers the lowest possible prices.","subtype":"SESSION","startTimestamp":1391697600,"webLink":"","presenterIds":["538"],"endTimestamp":1391700000},{"id":"543","title":"Protocoder - An open source prototyping environment for Android devices","location":"19","description":"Protocoder is a superfast to setup and code prototyping environment + Javascript framework for Android devices. Last summer during a Motorola ATAP (Advance Technology and Projects) project, we had a roadtrip across the US carrying different digital fabrication tools and hackable phones where we allowed University students from a variety of disciplines (art, design, engineering) to create projects during a weekend time frame.One of the concerns we had was the setup time and learning curve that Android tools have for traditional development. Those tools are not suited for everyone and every purpose, so we started a new project http://www.protocoder.org to tackle that and democratize Android development to different disciplines.Protocoder is a development environment + framework that lives in any Android device, phone, tablet, watches or even google glass. Just need a one click to install the environment on the device and then connect to it with a web browser using the local network or USB. It offers a web IDE hosted in the device it self for writing code, controlling the device or visualizing data. Protocoder tries to minimize the code written to a ratio of 12 to 1 lines of code. Sometimes even more. It just simplifies the code for the 90% percent of the people. As the nature of the MakeWithMoto project was hardware hacking, Protocoder offers easy access to microcontrollers such as Arduino or IOIO board, so combining them with the internal sensor array of most Android devices and fast CPUs makes Protocoder + Android + uControllers a great platform to consider for fast prototyping of physical and digital applications.Android is a fast rising platform, not only for mobile phones but for a big range of devices and form factors. Android as a community should start developing tools that can democratize the use and more important, creation on top of this platform to people willing to make, tinker and create. Protocoder is just a step forward.","subtype":"SESSION","startTimestamp":1391697600,"webLink":"","presenterIds":["542"],"endTimestamp":1391700000},{"id":"541","title":"RhoMobile Suite","location":"21","description":"Attendees will learn how to incorporate these power moves in every communication: Decipher toe talk, what is your customer revealing when he goes up on his toes, she crossed her ankles, or he suddenly takes a wide stance and immediately modify your personal behavior to get to “YES!” faster! Master the art of decoding and using Statement Analysis during all sales pitches and transactions and begin to think like an FBI agent or CIA operative when you spot deception in someone’s words Expose fibs in e-mails, Facebook, over the phone, and in person and always have the upper-hand in any situation – professionally or personally. Tune up your power gestures Stop making the 3 biggest mistakes that all level of employees and even executives do that make their bosses nervous - nobody succeeds when they have a nervous boss! Spot discomfort and deviations in hidden facial expressions and take immediate action to decrease their concerns, and ultimately get the business. Janine’s message is simple: educate yourself about how you are communicating and it will improve your personal and professional life!","subtype":"SESSION","startTimestamp":1391697600,"webLink":"","presenterIds":["540"],"endTimestamp":1391700000},{"id":"533","title":"WORKSHOP: Android Security - il Key Management","location":"22","description":"Il workshop tratterà alcuni aspetti legati alle problematiche di sicurezza riguardanti il “Key Management” per le applicazioni Android. Nella prima parte dell’intervento verranno analizzati diversi scenari in cui r kmisulta necessario proteggere i dati utilizzati da un'applicazione; seguirà un introduzione teorica sulle possibili tecniche disponibili per la protezione dei dati mediante crittosistemi a chiave simmetrica e asimmetrica. Si proseguirà poi con la descrizione e l'implementazione di alcune tecniche di Key Management utilizzate per la gestione sicura delle chiavi di cifratura per algoritmi simmetrici, tenendo in considerazione l’eventuale interazione con l'utente finale. Nella parte conclusiva si analizzeranno gli strumenti messi a disposizione da Android per la gestione delle chiavi private e dei rispettivi certificati utilizzati in algoritmi asimmetrici, come il KeyChain ed il nuovo “Android Key Store”, disponibile dalla versione 4.3. Il workshop si svolgerà alternando sessioni teoriche a sessioni pratiche di coding, durante le quali i partecipanti potranno utilizzare e mettere in pratica i concetti esposti durante l’intervento.","subtype":"SESSION","startTimestamp":1391697600,"webLink":"","presenterIds":["530"],"endTimestamp":1391700000},{"id":"549","title":"Barcamp","location":"22","description":"","subtype":"SESSION","startTimestamp":1391701200,"webLink":"","presenterIds":["544"],"endTimestamp":1391703000},{"id":"548","title":"Barcamp","location":"19","description":"","subtype":"SESSION","startTimestamp":1391701200,"webLink":"","presenterIds":["544"],"endTimestamp":1391703000},{"id":"547","title":"Barcamp","location":"21","description":"","subtype":"SESSION","startTimestamp":1391701200,"webLink":"","presenterIds":["544"],"endTimestamp":1391703000},{"id":"546","title":"Barcamp","location":"18","description":"","subtype":"SESSION","startTimestamp":1391701200,"webLink":"","presenterIds":["544"],"endTimestamp":1391703000},{"id":"553","title":"Barcamp","location":"22","description":"","subtype":"SESSION","startTimestamp":1391703600,"webLink":"","presenterIds":["544"],"endTimestamp":1391706000},{"id":"552","title":"Barcamp","location":"19","description":"","subtype":"SESSION","startTimestamp":1391703600,"webLink":"","presenterIds":["544"],"endTimestamp":1391706000},{"id":"551","title":"Barcamp","location":"21","description":"","subtype":"SESSION","startTimestamp":1391703600,"webLink":"","presenterIds":["544"],"endTimestamp":1391706000},{"id":"550","title":"Barcamp","location":"18","description":"","subtype":"SESSION","startTimestamp":1391703600,"webLink":"","presenterIds":["544"],"endTimestamp":1391706000},{"id":"554","title":"Android UI testing with Espresso","location":"20","description":"This is a practical session (workshop or live coding) on how to write better/faster UI Android automated tests using Google's Espresso testing API. We will see: - How to set it up in a project using Gradle. - How to write tests in a real world example. - Extending its API with custom matchers. - Extras: tips & set it up in a maven project.","subtype":"SESSION","startTimestamp":1391760000,"webLink":"","presenterIds":["499"],"endTimestamp":1391762400},{"id":"568","title":"Arricchire l’ecosistema Android: la proposta di Intel","location":"21","description":"Intel offre un insieme completo di strumenti di progettazione, codifica e debug per le applicazioni scritte in codice nativo destinate ai dispositivi mobili, smartphone e tablet, basati su sistema operativo Android. Scoprite i sorprendenti vantaggi nello sviluppare applicazioni per Android con Intel Hardware Accelerated Execution Manager e con gli altri tools messi a disposizione da Intel Developer Zone. Infine un accenno a Project Anarchy™ di Havok™: un motore gratuito per sviluppare videogame su piattaforme mobile.","subtype":"SESSION","startTimestamp":1391760000,"webLink":"","presenterIds":["566"],"endTimestamp":1391762400},{"id":"582","title":"WORKSHOP: Android ROM Cooking","location":"19","description":"In this tutorial, you will have a hands-on journey of customizing and building Android right off the Android Open Source Project (AOSP). We will begin with introducing the concepts of ROM cooking for any Android compatible device, and we we will then walk-through the build system of the AOSP. You will learn what Android is made of, how to build a bullet speed Android emulator, and how to build a minimal, fully operational Android configuration that will run on the QEMU virtual machine. You will step out of the classroom with the ability to follow the exact steps made in the tutorial to jump-start building your own Android system for any Virtual Machine - and with the tools and knowledge to build it for any custom device! Note: The tutorial is extremely hands on. Although it is not a strict requirement, it is strongly recommended to come prepared with a setup of Linux or OS X with the source code for an Android platform from http://source.android.com","subtype":"SESSION","startTimestamp":1391760000,"webLink":"","presenterIds":["493"],"endTimestamp":1391762400},{"id":"596","title":"WORKSHOP: Baasbox Base","location":"22","description":"","subtype":"SESSION","startTimestamp":1391760000,"webLink":"","presenterIds":["594"],"endTimestamp":1391762400},{"id":"555","title":"Designing Accessible Android Applications","location":"20","description":"Integrating accessibility features into new or existing applications to make it stand out and reachable to more users. The session will cover: Importance of accessibility while designing an application. Android’s built-in accessibility features and its evolution in different Android versions. This will include Android’s built in support for touch, speech and many other features that can be incorporated to make an application more accessible. Deep dive into few of the available features like sensors, haptics, and gestures that will make the application stand out and be more accessible. Code examples explaining accessibility features. Tips to add common useful effects that goes a long way in creating a compelling User Interface.","subtype":"SESSION","startTimestamp":1391763000,"webLink":"","presenterIds":["494"],"endTimestamp":1391765400},{"id":"569","title":"Ok Glass, compile my code","location":"21","description":"Glass Widgets + Timeline + Live cards + Static cards + Immersions + Menus and inputs GDK VS Mirror APIs + when use GDK + when use Mirror APIs + both? Glass Development Kit + API overview + environment setup + simple test app Mirror APIs + API overview + enabling Mirror APIs + project configuration + deploying test project","subtype":"SESSION","startTimestamp":1391763000,"webLink":"","presenterIds":["492"],"endTimestamp":1391765400},{"id":"583","title":"WORKSHOP: Android ROM Cooking","location":"19","description":"In this tutorial, you will have a hands-on journey of customizing and building Android right off the Android Open Source Project (AOSP). We will begin with introducing the concepts of ROM cooking for any Android compatible device, and we we will then walk-through the build system of the AOSP. You will learn what Android is made of, how to build a bullet speed Android emulator, and how to build a minimal, fully operational Android configuration that will run on the QEMU virtual machine. You will step out of the classroom with the ability to follow the exact steps made in the tutorial to jump-start building your own Android system for any Virtual Machine - and with the tools and knowledge to build it for any custom device! Note: The tutorial is extremely hands on. Although it is not a strict requirement, it is strongly recommended to come prepared with a setup of Linux or OS X with the source code for an Android platform from http://source.android.com","subtype":"SESSION","startTimestamp":1391763000,"webLink":"","presenterIds":["493"],"endTimestamp":1391765400},{"id":"597","title":"WORKSHOP: Baasbox Base","location":"22","description":"","subtype":"SESSION","startTimestamp":1391763000,"webLink":"","presenterIds":["594"],"endTimestamp":1391765400},{"id":"556","title":"Graphical Magic","location":"20","description":"The android.graphics APIs contain some useful tools which enable us to perform some tricks more commonly associated with Photoshop or Gimp. It is not always possible to use such tools, particularly when images are being loaded dynamically from external sources. Mark Allison, author of http://blog.styling android.com, explores these APIs and shows you get some amazing results by dynamically altering images in your app.","subtype":"SESSION","startTimestamp":1391766000,"webLink":"","presenterIds":["438"],"endTimestamp":1391767800},{"id":"571","title":"Sviluppo RAD nativo e crossplatform per applicazioni business","location":"21","description":"Delphi per Android e iOS è un nuovo strumento di sviluppo che permette di scrivere un solo codice sorgente e utilizzare un solo framework, per compilate app native per più sistemi operativi (attualmente Android e iOS). Questa caratteristica unica, unita ad un designer RAD, allo sviluppo visuale e ad un completo stack per l'accesso a database e web service, lo rende un tool perfetto per la scrittura di applicazioni business in tempi brevi. Inoltre, l'accesso a database è fortemente semplificato da un evoluto set di componenti dedicati e cross platform. In questo talk, saranno mostrati molti esempi real-world che renderanno evidente il forte risparmio che lo strumento permette allo sviluppatore in termini di tempo di sviluppo (grazie all'ambiente RAD) e di manutenzione (grazie al single code base).","subtype":"SESSION","startTimestamp":1391766000,"webLink":"","presenterIds":["570"],"endTimestamp":1391767800},{"id":"584","title":"WORKSHOP: Android ROM Cooking","location":"19","description":"In this tutorial, you will have a hands-on journey of customizing and building Android right off the Android Open Source Project (AOSP). We will begin with introducing the concepts of ROM cooking for any Android compatible device, and we we will then walk-through the build system of the AOSP. You will learn what Android is made of, how to build a bullet speed Android emulator, and how to build a minimal, fully operational Android configuration that will run on the QEMU virtual machine. You will step out of the classroom with the ability to follow the exact steps made in the tutorial to jump-start building your own Android system for any Virtual Machine - and with the tools and knowledge to build it for any custom device! Note: The tutorial is extremely hands on. Although it is not a strict requirement, it is strongly recommended to come prepared with a setup of Linux or OS X with the source code for an Android platform from http://source.android.com","subtype":"SESSION","startTimestamp":1391766000,"webLink":"","presenterIds":["493"],"endTimestamp":1391767800},{"id":"598","title":"WORKSHOP: Baasbox Base","location":"22","description":"","subtype":"SESSION","startTimestamp":1391766000,"webLink":"","presenterIds":["594"],"endTimestamp":1391767800},{"id":"557","title":"Case Studies in Android Design","location":"20","description":"Join Jamie McDonald for a tour of the Android UX landscape, including patterns, tips, techniques and tools - all grounded in real world examples. Come and find out how to build apps that stand out by crafting interfaces that are simple, beautiful and usable!","subtype":"SESSION","startTimestamp":1391769600,"webLink":"","presenterIds":["482"],"endTimestamp":1391771400},{"id":"573","title":"Simplify Android Application Testing and Presentation with Genymotion","location":"21","description":"This talk will introduce Genymotion, the fast and easy-to-use Android emulator.","subtype":"SESSION","startTimestamp":1391769600,"webLink":"","presenterIds":["572"],"endTimestamp":1391771400},{"id":"585","title":"WORKSHOP: Android ROM Cooking","location":"19","description":"In this tutorial, you will have a hands-on journey of customizing and building Android right off the Android Open Source Project (AOSP). We will begin with introducing the concepts of ROM cooking for any Android compatible device, and we we will then walk-through the build system of the AOSP. You will learn what Android is made of, how to build a bullet speed Android emulator, and how to build a minimal, fully operational Android configuration that will run on the QEMU virtual machine. You will step out of the classroom with the ability to follow the exact steps made in the tutorial to jump-start building your own Android system for any Virtual Machine - and with the tools and knowledge to build it for any custom device! Note: The tutorial is extremely hands on. Although it is not a strict requirement, it is strongly recommended to come prepared with a setup of Linux or OS X with the source code for an Android platform from http://source.android.com","subtype":"SESSION","startTimestamp":1391769600,"webLink":"","presenterIds":["493"],"endTimestamp":1391771400},{"id":"602","title":"WORKSHOP: Baasbox Avanzato","location":"22","description":"","subtype":"SESSION","startTimestamp":1391769600,"webLink":"","presenterIds":["595"],"endTimestamp":1391771400},{"id":"574","title":"Clean Android Code","location":"21","description":"The benefits of Clean Code are obvious: stable programs, better maintainability, finding bugs faster and easier upgrading of software. A lot of advices have been already written about Java clean code (first of all in Robert C. Martin book), what about Android? Are the same advices valid? Or the way we write code must be different because it's a mobile platform? Are there any best practices about resources and the other Android stuff? In this talk we'll see some practical examples of how take advantage of Java and Android framework to write clean code and keep a project manageable.","subtype":"SESSION","startTimestamp":1391772000,"webLink":"","presenterIds":["479"],"endTimestamp":1391774400},{"id":"587","title":"The Android platform in the era of Internet of Things","location":"19","description":"The widespread availability of mobile devices, significantly changed the market making them attractive to an endless number of always connected applications and services. At the same time, academia and companies focused and invested significantly on the Internet of Things (IoT) and the Machine- to-Machine (M2M) paradigm. IoT and M2M are inherently ready to be integrated with the World Wide Web and many approaches and techniques have been shared and extended. In this scenario many actors start talking and defining the concept of Web of Thing (WoT) envisioning a world where devices are exposed using WWW languages. In this session, you will be briefly introduced to the main concepts that characterize and define the Internet of Things and how mobile devices will play a fundamental role in the upcoming global scenario. The session will introduce and present the characteristics of the main approaches and protocols adopted in M2M and IoT applications (in particular CoAP, CoSIP, MQTT, and HTTP) and how they could be used on the Android platform through some key libraries and examples. Main challenges that will be faces during the talk are related to the communication among heterogeneous devices, the protocols management and the dynamic service discovery.","subtype":"SESSION","startTimestamp":1391772000,"webLink":"","presenterIds":["586"],"endTimestamp":1391774400},{"id":"558","title":"Timing In User Interfaces","location":"20","description":"Time is an important and unavoidable factor in apps. It is influenced by technical aspects like the hardware of an Android devices to psychological aspects like the expectations of a user. Independent from those factors, a user experiences how an app uses his time, from clicking a button to slow downloads, and he decides whether its worth it. So its on the developer to make his time worthwhile. Andre from enough Software will talk about the user's perception of time, showcases how to optimize short processes to create an instant feeling and how to design and present long processes to keep a user interested.","subtype":"SESSION","startTimestamp":1391772000,"webLink":"","presenterIds":["475"],"endTimestamp":1391774400},{"id":"603","title":"WORKSHOP: Baasbox Avanzato","location":"22","description":"","subtype":"SESSION","startTimestamp":1391772000,"webLink":"","presenterIds":["595"],"endTimestamp":1391774400},{"id":"575","title":"Best Practices to develop for different Android Device Classifications","location":"21","description":"This Session will give a best practices from the Immobilienscout24 Development for the different Android device classifications. During this presentation you can experience the learnings, which the presenter got during development of the ImmobilienScout 24 Android application. The presentation doesn’t cover Design, UX or Fragments, but it gives an introduction and samples of using different resources, in special layouts. These folders can be used for filtering specific configurations, referencing other resources and using layout aliases. This session aims at people with knowledge of coding for Android. Conclusion: The developers should loose their fear of developing for different screensizes in one application.","subtype":"SESSION","startTimestamp":1391778000,"webLink":"","presenterIds":["481"],"endTimestamp":1391780400},{"id":"559","title":"Teaching your client Android design, or, Ridding the world of iPhoneys.","location":"20","description":"Clients don’t get Android. Design agencies really don’t get Android. They seem to think that if you take an iPhone app and stick an Android badge on it, then you’re done. But users are smarter than that these days, and they want, and deserve, and demand better. This talk will give you the confidence to stand up to your client and tell them where they’re wrong, where their design agency’s wrong, and show them that you really know how to make a proper native Android app and convince them to trust you and come along for the ride. It’s your absolute duty as an Android professional to help your client by correcting them in this way – but of course you can’t say that without some serious supporting foundation. And of course no fear of being fired - but that’s another story. So we’ll talk about Android design patterns, Android anti-patterns, and how to add those little flourishes that surprise and delight your users; where to obey Google guidelines, and where to deviate; and how to work with designers and product owners to mould their original vision into a proper native Android app that sits comfortably in its little green robot home. Kenton will be illustrating this talk with his experiences developing BBC Weather and Summly this year. Within a month of release, BBC Weather became the BBC’s third most popular Android app after iPlayer and News, its highest-rated Android app with a rating of 4.7 and the ratio of 5* to 1* reviews at over 100 to 1, with users raving about its native Android credentials. It became the fifth app he’s worked on to be featured by Google on Play Store. Summly was famously sold to Yahoo who immediately closed down the iPhone app and shuttered the Android app days before its release, but it’s still worth using it as an example of how to take a great iPhone app and make an even better Android app from it.","subtype":"SESSION","startTimestamp":1391778000,"webLink":"","presenterIds":["483"],"endTimestamp":1391780400},{"id":"599","title":"WORKSHOP: Baasbox Base","location":"22","description":"","subtype":"SESSION","startTimestamp":1391778000,"webLink":"","presenterIds":["594"],"endTimestamp":1391780400},{"id":"589","title":"WORKSHOP: Using the Android NDK","location":"19","description":"Of course games are the first clients for the Android NDK, but these are not the only ones. Many (~40%) of the Android most highly ranked apps are integrating native libraries. You’ll need to understand the NDK if you want to integrate C/C++ code into your Android app yourself. Knowing more about it will also be useful if you ever use libraries with platform-specific binaries (like libgdx, AllJoyn…). In this workshop you’ll get to know the Android NDK better, when/how to use it ; and what it implies to do so from development, integration within Eclipse and Android Studio, to distribution.","subtype":"SESSION","startTimestamp":1391778000,"webLink":"","presenterIds":["588"],"endTimestamp":1391780400},{"id":"576","title":"LIKE '%smth%' is not the way to go","location":"21","description":"During the presentation you'll have a chance to listen about different approaches to the content search problem on Android, especially in apps that need to work offline. Later on, you'll hear some detailed word about SQLite's FTS3 native extension and what possibilities it gives to developers.","subtype":"SESSION","startTimestamp":1391781000,"webLink":"","presenterIds":["489"],"endTimestamp":1391783400},{"id":"560","title":"The eternal question: Android or iOS first? Android, but take care of UX and follow design guidelines","location":"20","description":"Seriously, you should start your mobile-related startup with an Android app, but there are many challenges that you need to fight to be competitive. First things first, you need to create a magical user experience solving a real problem. We will discuss why starting from Android could be the right strategy and how to use a lean approach to design a better user experience.","subtype":"SESSION","startTimestamp":1391781000,"webLink":"","presenterIds":["491"],"endTimestamp":1391783400},{"id":"600","title":"WORKSHOP: Baasbox Base","location":"22","description":"","subtype":"SESSION","startTimestamp":1391781000,"webLink":"","presenterIds":["594"],"endTimestamp":1391783400},{"id":"590","title":"WORKSHOP: Using the Android NDK","location":"19","description":"Of course games are the first clients for the Android NDK, but these are not the only ones. Many (~40%) of the Android most highly ranked apps are integrating native libraries. You’ll need to understand the NDK if you want to integrate C/C++ code into your Android app yourself. Knowing more about it will also be useful if you ever use libraries with platform-specific binaries (like libgdx, AllJoyn…). In this workshop you’ll get to know the Android NDK better, when/how to use it ; and what it implies to do so from development, integration within Eclipse and Android Studio, to distribution.","subtype":"SESSION","startTimestamp":1391781000,"webLink":"","presenterIds":["588"],"endTimestamp":1391783400},{"id":"563","title":"Conquering concurrency: bringing the Reactive Extensions to the Android platform","location":"20","description":"Without a doubt, concurrency is one of the toughest problems to deal with in day to day programming. Being based on Java, Android comes with a number of low level concurrency abstractions such as Java Threads and the slightly higher level AsyncTask, which however suffer from common problems inherent to imperative languages, such as the need to synchronize access to shared resources and being generally unsuited for composition. At SoundCloud we have recently turned to functional reactive programming as a means to dramatically simplify and streamline functionality that involves event based asynchronous operations such as disk or network I/O followed by updates on the UI thread. In this talk I will show how we employ RxJava, a library that supports a functional-reactive approach to programming on the Java platform, to hook up fragments to any number or combination of concurrent data sources without writing a single line of threading or synchronization code.","subtype":"SESSION","startTimestamp":1391784000,"webLink":"","presenterIds":["562"],"endTimestamp":1391786400},{"id":"577","title":"Multiplatform HTML5: It's actually possible... maybe!","location":"21","description":"HTML5 has been advertised as one of the optimal solutions for single codebase multiplatform apps, but it is pretty hard to find success stories when it comes to the mobile market and exceptionally hard when it comes to Android. Facebook based their initial mobile strategy on HTML5 only to revert it to native apps a couple of years later, mainly due to performances issues and to the always-growing platform-specific code. I will illustrate two series of cases where HTML5 is the optimal solution and where it should not be used and why. During the development of our next HTML5 Game Engine, we encountered some of them and found possible workarounds or proper solutions. The talk will be mainly focused on finding out the current status of HTML5 support for Android and it will illustrate possible scenarios where it actually makes sense to support a single codebase multiplatform app and how to hack an app design to fit HTML5 best practices.","subtype":"SESSION","startTimestamp":1391784000,"webLink":"","presenterIds":["497"],"endTimestamp":1391786400},{"id":"591","title":"WORKSHOP: Android per Internet delle Cose con l'aiuto dei Google Cloud Messaging","location":"19","description":"Il workshop fa parte di una serie di iniziative promosse dal Google Developer Group di Roma LAB per l'Internet delle Cose. In questo caso il dispositivo Android è destinato al controllo di una serie di oggetti mediante Tag a Radiofrequenza e dovrà compiere due tipi di attività: effettuare delle azioni di controllo sugli oggetti nel suo raggio di azione inviare al Centro i dati ottenuti Per realizzare ciò verrà utilizzato il servizio Google Cloud Messaging, che permette di ottimizzare le risorse, gestire ed organizzare i messaggi in modo bidirezionale ed è totalmente gratuito. Il workshop, dopo una introduzione generale sulle tematiche e sulle tecnologie utilizzate, consentirà ai partecipanti di sviluppare il codice e di provare l'applicazione.","subtype":"SESSION","startTimestamp":1391784000,"webLink":"","presenterIds":["530"],"endTimestamp":1391786400},{"id":"601","title":"WORKSHOP: Baasbox Base","location":"22","description":"","subtype":"SESSION","startTimestamp":1391784000,"webLink":"","presenterIds":["594"],"endTimestamp":1391786400},{"id":"564","title":"Building Wunderlist. Lessons learned.","location":"20","description":"During the creation of Wunderlist we have learned a lot of things. Since June 2012 where we started the creation of the 2nd release, we have growth from around 400.000 downloads to more than 2 millions, we've been featured in Google Play Store (actually we are in the Editor's Choice), Google Play for Education, Amazon App Store, etc. We've learned a lot of things that previously we didn't think that was like that, we've learned how to solve sometimes easy problems, sometimes really difficult ones, we've broken false myths, we've managed a real multiplatform app that is available on the main platforms working together like charm, etc. So in this talk I will talk about the things we've learned building a multimillion and successful Android app.","subtype":"SESSION","startTimestamp":1391787600,"webLink":"","presenterIds":["476"],"endTimestamp":1391790000},{"id":"579","title":"Videogames crossplatform con Gideros","location":"21","description":"Con la crescita del mercato app/games per dispositivi mobile, stanno prendendo piede anche molti strumenti di sviluppo, in particolare quelli cross-platform, che consentono di riutilizzare lo stesso codice su più piattaforme. Gideros è un ottimo esempio di tali strumenti. Gideros Studio è un ambiente multipiattaforma per lo sviluppo mobile, che consente di sviluppare app in modo facile e veloce. In questo talk vedremo quali sono le guide-line per sviluppare videogames su dispositivi mobile ed entreremo nel dettaglio dell'intero enviroment Gideros mostrando tutte le fasi dello sviluppo di un videogioco attraverso numerosi How-To.","subtype":"SESSION","startTimestamp":1391787600,"webLink":"","presenterIds":["578"],"endTimestamp":1391790000},{"id":"592","title":"WORKSHOP: Android per Internet delle Cose con l'aiuto dei Google Cloud Messaging","location":"19","description":"Il workshop fa parte di una serie di iniziative promosse dal Google Developer Group di Roma LAB per l'Internet delle Cose. In questo caso il dispositivo Android è destinato al controllo di una serie di oggetti mediante Tag a Radiofrequenza e dovrà compiere due tipi di attività: effettuare delle azioni di controllo sugli oggetti nel suo raggio di azione inviare al Centro i dati ottenuti Per realizzare ciò verrà utilizzato il servizio Google Cloud Messaging, che permette di ottimizzare le risorse, gestire ed organizzare i messaggi in modo bidirezionale ed è totalmente gratuito. Il workshop, dopo una introduzione generale sulle tematiche e sulle tecnologie utilizzate, consentirà ai partecipanti di sviluppare il codice e di provare l'applicazione.","subtype":"SESSION","startTimestamp":1391787600,"webLink":"","presenterIds":["530"],"endTimestamp":1391790000},{"id":"604","title":"WORKSHOP: Baasbox Avanzato","location":"22","description":"","subtype":"SESSION","startTimestamp":1391787600,"webLink":"","presenterIds":["595"],"endTimestamp":1391790000},{"id":"565","title":"(O)Authenticated Rest interaction for Android ","location":"20","description":"Last year, I started writing a library inspired by the talk Virgil Dobjanschi gave at Google IO 2010 about interaction with rest services.In this talk I am going to describe the best ways to interact with a rest service, including off the shelf solutions such as volley, robospice, and others, and my very own postmanlib. On top of that, I will talk about OAuth and how my library relieves the pain of handling oauth2 authentication.","subtype":"SESSION","startTimestamp":1391790600,"webLink":"","presenterIds":["490"],"endTimestamp":1391793000},{"id":"580","title":"Prototyping your Android app, the (U)X-factor","location":"21","description":"Prototypes can be a great way to improve Android application results on two fronts: they can prove a concept or improve on it, and they can teach you valuable lessons about the best ways to develop the product. This session will provide practical information about the approach and experiences implementing prototyping.","subtype":"SESSION","startTimestamp":1391790600,"webLink":"","presenterIds":["498"],"endTimestamp":1391793000},{"id":"593","title":"WORKSHOP: Android per Internet delle Cose con l'aiuto dei Google Cloud Messaging","location":"19","description":"Il workshop fa parte di una serie di iniziative promosse dal Google Developer Group di Roma LAB per l'Internet delle Cose. In questo caso il dispositivo Android è destinato al controllo di una serie di oggetti mediante Tag a Radiofrequenza e dovrà compiere due tipi di attività: effettuare delle azioni di controllo sugli oggetti nel suo raggio di azione inviare al Centro i dati ottenuti Per realizzare ciò verrà utilizzato il servizio Google Cloud Messaging, che permette di ottimizzare le risorse, gestire ed organizzare i messaggi in modo bidirezionale ed è totalmente gratuito. Il workshop, dopo una introduzione generale sulle tematiche e sulle tecnologie utilizzate, consentirà ai partecipanti di sviluppare il codice e di provare l'applicazione.","subtype":"SESSION","startTimestamp":1391790600,"webLink":"","presenterIds":["530"],"endTimestamp":1391793000},{"id":"605","title":"WORKSHOP: Baasbox Avanzato","location":"22","description":"","subtype":"SESSION","startTimestamp":1391790600,"webLink":"","presenterIds":["595"],"endTimestamp":1391793000}]}