{"sessions":[{"id":"364","title":"CheapCast: ChromeCast without ChromeCast","location":"15","description":"Recently hitting the headlines Sebastian Mauer has developed CheapCast, emulating a ChromeCast Dongle on (almost) any Android Device. This involved setting up Service Discovery using SSDP, an HTTP- and WebSocket Server and an Activity to render the actual ChromeCast Receiver WebApp. What Sebastian found out is that the Android WebView is kind of limited and needed to be enhanced to be usable for realizing a ChromeCast Emulator. Sebastian will show that during the development of CheapCast the WebView was extended to support WebSockets using a special JavaScript Interface with bindings to Java Code.","subtype":"KEYNOTE","startTimestamp":1385371800,"webLink":"","presenterIds":["363"],"endTimestamp":1385374500},{"id":"366","title":"Google GLASS","location":"16","description":"Rob Rusher from On3 Inc will fly in from Denver and present the most interesting example of wearable computing to date: Google GLASS Come experience what it is like to use and develop applications for Google GLASS. This session will demonstrate the features and function of Google GLASS as well as introduce you to how to build Glassware. And “Yes!”, you can even try it out. ","subtype":"SESSION","startTimestamp":1385374500,"webLink":"","presenterIds":["365"],"endTimestamp":1385377200},{"id":"368","title":"Mobile Engineering @ SoundCloud","location":"15","description":"Building a mobile engineering team that delivers an engaging mobile experience to millions of users takes more than just technology. SoundCloud itself has learned a lot starting from its humble beginnings to where it is today by evolving its practices and tools as it scales both in terms of users and its engineering team. This talk will give an insight into how the SoundCloud mobile team delivers its mobile applications including the Agile process we use, our testing and continuous delivery practices and will touch on the architecture of the Android SoundCloud application.","subtype":"SESSION","startTimestamp":1385374500,"webLink":"","presenterIds":["367"],"endTimestamp":1385377200},{"id":"356","title":"Sekai Phone & Cross-Platform development","location":"15","description":"Flying in from Japan, Kenichi is one of the most recognized Android guru’s from Japan. Amongst the 20+ applications developed by Kenichi he is the creator of ‘Sekai Phone’, a realtime translation phone service. This application won the 1st prize on Multi Screen UX competition 2013 and was displayed at Mobile World Congress 2013 and Google Developer Days in Japan. During his presentation Kenichi will show how he has used API’s such as Daydream and GCM and how the application enables speakers with different languages to communicate with each other. Kenichi will share best practices (Overview, Comparison, Cross-platform development) combined with a demonstration.","subtype":"KEYNOTE","startTimestamp":1385458200,"webLink":"","presenterIds":["352"],"endTimestamp":1385460900},{"id":"359","title":"The Cult of Culture","location":"15","description":"Culture is the buzz word of today’s tech community. It seems everyone is concerned with how to create a culture, how to maintain a culture, how to display their culture. What differentiates their culture from others. But there doesn’t seem to be much talk about what culture actually is. In his talk Github’s Yossef Mendelssohn talks about culture which means a lot of things to a lot of people. Culture is about what we want to improve, what we want to foster, what we want to encourage. Culture is about what we want to cultivate. Culture, really, is about what we want to define us. Culture is hard to contain in a pithy statement, even one as nice as “optimize for happiness”.","subtype":"SESSION","startTimestamp":1385460900,"webLink":"","presenterIds":["357"],"endTimestamp":1385463600}]}