{"sessions":[{"id":"694","title":"Opening","location":"46","description":"","subtype":"KEYNOTE","startTimestamp":1400223600,"webLink":"","presenterIds":["693"],"endTimestamp":1400224500},{"id":"703","title":"Sony Developer World – what’s new and beyond","location":"46","description":"Sony has an ambition to work close with partners and developers. In this session, I will talk about Sony SDKs available today, but also give a glimpse of what activities we have around the corner. The presentation will go into everything from what’s new in the Sony SmartWatch 2 SDK and the Camera Remote API beta SDK, with which you can control Sony cameras from your smartphone app, to the latest information about the SmartEyeglass concept.\r\n\r\nWe really look forward to meeting many talented developers, and we hope you will join our session!","subtype":"KEYNOTE","startTimestamp":1400224500,"webLink":"http://www.androiddeveloperdays.com/sessions/keynotesony-developer-world-whats-new-and-beyond/","presenterIds":["701"],"endTimestamp":1400226300},{"id":"714","title":"11:00 - Analytical Ad Optimization – When, where, how and why?","location":"49","description":"The numbers behinds the world of advertising optimization.\r\nWhen to serve an ad, where to place it, how to optimize it and the money you can generate from it.\r\nProgrammatic ad optimization is the reason that publishers are able to generate high revenue in real time. “","subtype":"SESSION","startTimestamp":1400227200,"webLink":"http://www.androiddeveloperdays.com/sessions/analytical-ad-optimization-when-where-how-and-why/","presenterIds":["710"],"endTimestamp":1400229900},{"id":"715","title":"11:25 - How second screens can enhance your app","location":"49","description":"The session aims to provide an overview of existing second screens that currently can be used to enhance your app.\r\nIt also provides information on the general idea of how second screens extend your user’s immersion into the app.","subtype":"SESSION","startTimestamp":1400227200,"webLink":"http://www.androiddeveloperdays.com/sessions/how-second-screens-can-enhance-your-app/","presenterIds":["711","712"],"endTimestamp":1400229900},{"id":"706","title":"Details Matter – Understanding Android UI Design Patterns","location":"46","description":"Android finally has established design guidelines and widely used UI design patterns. Android users understand functionality of components like the navigation drawer, action bar, sharing and many more. However, the guidelines are just that, guidelines, not rules. All Android apps should not look alike but neither should they all reinvent all the controls. In this presentation I want to take a deep dive into details of the common design patterns and how they can be customised without compromising usability. I want to help developers and designers alike to understand how to correctly use Android UI design patterns.","subtype":"SESSION","startTimestamp":1400227200,"webLink":"http://www.androiddeveloperdays.com/sessions/details-matter-understanding-android-ui-design-patterns/","presenterIds":["704"],"endTimestamp":1400229900},{"id":"708","title":"How to build rock-solid apps and keep 100M+ users happy","location":"47","description":"Shazam is a very popular audio recognition app. It is installed on 100M+ Android devices and it’s growing rapidly (#2 in Audio apps in Turkey).\r\n\r\nIn this talk, we’d like to address how we’ve made our releases schedule faster, more predictable and with more features by using BDD and automation testing. We’ll demonstrate how that can be done without slowing down or hindering the development process and why our developers actually find writing tests is fun. Finally, we’ll look at how our testing strategy has translated to our testing framework and hardware infrastructure.","subtype":"SESSION","startTimestamp":1400227200,"webLink":"http://www.androiddeveloperdays.com/sessions/how-to-build-rock-solid-apps-and-keep-100m-users-happy/","presenterIds":["707"],"endTimestamp":1400229900},{"id":"713","title":"Mobile Engineering @ SoundCloud","location":"48","description":"Building robust and innovative mobile applications as you scale an engineering team requires constant evolution and adaptation in not just technology but also the software development process. As the SoundCloud mobile team is rapidly growing, we are going through a lot of changes both in the way we develop our software and the technology choices we make. In this talk, we will touch on parts of our process and go into how we are evolving the architecture of our Android application to allow our engineering teams to scale while still maintaining a focus on quality & productivity","subtype":"SESSION","startTimestamp":1400227200,"webLink":"http://www.androiddeveloperdays.com/sessions/title-required-2/","presenterIds":["709"],"endTimestamp":1400229900},{"id":"720","title":"App Monetization Made Easy","location":"46","description":"In this talk Tim presents different ways to monetize Android applications including different payment models like subscriptions. After building up common sense he’ll go into the new PayPal Android SDK that helps to realize these models by providing a comfortable wrapper around a rather complex topic called payments. Closing with some live coding and Q&A this session should be of value to anyone who’s interested in payments in general or earning money with his Android application.","subtype":"SESSION","startTimestamp":1400230800,"webLink":"http://www.androiddeveloperdays.com/sessions/app-monetization-made-easy/","presenterIds":["716"],"endTimestamp":1400233500},{"id":"722","title":"So you’ve got a great idea….","location":"49","description":"Als’ talk is for people who want to take their Android based idea and make it into a business. He’ll cover some of the pitfalls that companies have to face, and provide some ideas on how to reduce the amount of stress they can cause.\r\n\r\nHe’ll cover topics such as funding sources, expanding your team, and where to concentrate your efforts as your idea becomes reality. Drawing on experiences from various companies he’s worked with he’ll offer some suggestions which will hopefully help you build the next big thing.","subtype":"SESSION","startTimestamp":1400230800,"webLink":"http://www.androiddeveloperdays.com/sessions/title-required/","presenterIds":["719"],"endTimestamp":1400233500},{"id":"721","title":"The Elegance Of Functional Testing Using Calabash","location":"48","description":"Continuously testing your applications is important to maintain the quality and to make sure problems don’t occur after making changes to the applications.\r\nThere are various frameworks out in the open that can help you create functional tests for your mobile applications. With many of these frameworks you need to have technical knowledge to create your functional tests.\r\nAn exception to this rule is Calabash. This framework allows both technical and a-technical people to elegantly create functional tests for Android and iOS using natural language. Ali will be talking about Calabash and how easy it will become to create functional tests once entering the world of Calabash.","subtype":"SESSION","startTimestamp":1400230800,"webLink":"http://www.androiddeveloperdays.com/sessions/the-elegance-of-functional-testing-using-calabash/","presenterIds":["718"],"endTimestamp":1400233500},{"id":"732","title":"1:45 - What if a smartphone readouts a smartmeter?","location":"49","description":"Since everthing getting more smart on these days and these smart devices are becoming a part of our life to make it easier.\r\nSmartphones and smartmeters are also examples of these kind of devices.\r\nI will explain you, how we can readout smartmeters by using Android Operating System.\r\nAnd what are the advantages of reading meters using android devices.","subtype":"SESSION","startTimestamp":1400237100,"webLink":"http://www.androiddeveloperdays.com/sessions/what-if-a-smartphone-readouts-a-smartmeter/","presenterIds":["726"],"endTimestamp":1400239800},{"id":"733","title":"2:10 - How to Make Your App Sound Better","location":"49","description":"How to Make Your App Sound Better as a session name and we will discuss why audio matters in mobile and offer tips on how to make the audio better in apps and games","subtype":"SESSION","startTimestamp":1400237100,"webLink":"http://www.androiddeveloperdays.com/sessions/how-to-make-your-app-sound-better/","presenterIds":["727"],"endTimestamp":1400239800},{"id":"731","title":"An introduction to Vaadin","location":"48","description":"Vaadin is Java framework for rapid development of highly interactive HTML5-based web applications in a server-side environment. It abstracts the underlying document and state transfer technologies (DOM, AJAX, JSON), allowing web applications to be developed in Java following desktop application patterns and design. Vaadin leverages the full power of GWT, a Java to Javascript compiler making it possible to develop the entire web application stack and new client-side components without leaving the Java environment.\r\n\r\nRapid development is facilitated by a great variety of library components and immediate server deployment. Vaadin applications are executed in server environment providing great enhancement for security as well as binding Vaadin frontend to any existing backend system. During the session attendees will get an overview of Vaadin 7.1, a closer look at the Vaadin architecture and what really happens behind the scenes of the framework. We will also cover the Vaadin TouchKit add-on, that provides mobile developers powerful tools to create server-based web applications that look and feel almost native.","subtype":"SESSION","startTimestamp":1400237100,"webLink":"http://www.androiddeveloperdays.com/sessions/session-4/","presenterIds":["725"],"endTimestamp":1400239800},{"id":"730","title":"Hello Camera Remote API!","location":"47","description":"Objective of this session is to learn how to control cameras from your smartphone app with Camera Remote API beta SDK.\r\nDuring this session you will learn how to develop remote control apps for a number of Sony cameras, including Sony Action cams, Sony Alpha cameras and Lens Style cameras – such as the Lens Style Camera QX10. We will go through the required steps and show you how to connect your smartphone or tablet to the Sony cameras over Wi-Fi to establish a one-to-one connection. Your app will then start working as a client and you will be able to call the APIs. This session will also address some new features that will be introduced in an upcoming update of the Camera Remote API beta SDK with even more APIs – like shutter speed functionality, white balance and ISO settings.","subtype":"SESSION","startTimestamp":1400237100,"webLink":"http://www.androiddeveloperdays.com/sessions/hello-camera-remote-api/","presenterIds":["724"],"endTimestamp":1400239800},{"id":"729","title":"Metrica for Apps – Understanding your app stats. How an analytics tool can help you to leverage the power of your app.","location":"46","description":"Alexander will give an overview of all the most popular mobile analytics tools, talk about their strong and weak points and introduce a free and easy-to-use alternative solution. He will also show how to incorporate it into your Android app.","subtype":"SESSION","startTimestamp":1400237100,"webLink":"http://www.androiddeveloperdays.com/sessions/metrica-for-apps/","presenterIds":["723"],"endTimestamp":1400239800},{"id":"744","title":"2:45 - Keep Rolling Sphero!","location":"48","description":"Sphero is tennis ball sized, programmable robotic ball which can be controlled with your phone or tablet.\r\nIt rolls on every kind of surface: rolls down on stairs or even in the water.\r\nThere are plenty of mobile apps and games in AppStore and PlayStore.\r\nThe creators of Sphero, Orbotix, published a wide spectrum of SDKs from Android to Unity platform.\r\nIn this presentation, I will talk about the following topics:\r\n-What is Sphero? What was the motivation of the founders?\r\n-Main features and building blocks of Sphero\r\n-Sphero and game industry\r\n-Programming for everyone: Macros and Orbbasic\r\n-How to start a basic Android application with Sphero SDK?","subtype":"SESSION","startTimestamp":1400240700,"webLink":"http://www.androiddeveloperdays.com/sessions/keep-rolling-sphero/","presenterIds":["738"],"endTimestamp":1400243400},{"id":"746","title":"2:45 - Next steps in mobile monetization – Introducing monetization with surveys","location":"49","description":"Mobile monetization is the biggest pain for app developers and publishers.\r\nThe industry is dramatically changing, focusing on other more effective ways of monetization. Pollfish brings user-friendly high-rewarding surveys into apps to help developers monetize better without ads.","subtype":"SESSION","startTimestamp":1400240700,"webLink":"http://www.androiddeveloperdays.com/sessions/title-required-3/","presenterIds":["740"],"endTimestamp":1400243400},{"id":"747","title":"3:10 - Standing on the shoulders of giant TVs","location":"49","description":"Two years ago, not letting go of older Android versions, yet also embracing post-Honeycomb versions seemed daunting. Today, it still is.\r\nBut open source software in the form of Action Bar Sherlock accelerated a solution. Around the same time, I started updating my apps, keeping them working as-is by using the official support library, as well as rolling my own generalizations, notably where Google TV is concerned. This aims to be a 201 level talk about leveraging your existing app features on Google TV, including the inevitable backward compatibility and the left nav bar. I will go beyond a quick documentation recap and show you some practical shortcuts and improvements that I used in my open source apps. You should be able to distill techniques for your own apps, for a Google TV expansion, or perhaps for the new upcoming classes of devices, such as native SDKs for Glass and Wear.","subtype":"SESSION","startTimestamp":1400240700,"webLink":"http://www.androiddeveloperdays.com/sessions/standing-on-the-shoulders-of-giant-tvs/","presenterIds":["741"],"endTimestamp":1400243400},{"id":"745","title":"3:10 - Story of Smartphone","location":"48","description":"This talk is about the story of a smart phone, processes of production of a smart phone in the aspect of hardware and software and what is done until it goes to market.","subtype":"SESSION","startTimestamp":1400240700,"webLink":"http://www.androiddeveloperdays.com/sessions/story-of-smartphone/","presenterIds":["739"],"endTimestamp":1400243400},{"id":"743","title":"Mobile Development As a Career","location":"47","description":"In the presentation with the title “Mobile Development As a Career” , important suggestions and recommendations will be given to the developers who wants to do mobile development in his/her career. Some solid experiences will be shared about what kind of a world they will face with.","subtype":"SESSION","startTimestamp":1400240700,"webLink":"http://www.androiddeveloperdays.com/sessions/mobile-development-as-a-career/","presenterIds":["737"],"endTimestamp":1400243400},{"id":"742","title":"Smartface App Studio","location":"46","description":"You don’t have to know Java for Android and Objective-C for iOS. Design your app with WYSIWYG design editor and code with JavaScript to develop fully native apps for Android and iOS. This is the new way to build for Mobile, Tablet, Gear, Glass and more…\r\n\r\nWe’re trying to provide the fastest possible development environment for you. We know that time is very important for all of us. Most of time in app development is spent for design work. Smartface App Studio offers you “What You See Is What You Get” design editor and integrated ready to use components inside. Create single JS code basement and Debug/Emulate on device in a real time. Your design will perfectly fit into Android and iOS devices. Just clicking on publish button gives you .apk for Android and .xcodeproj for iOS.\r\n\r\nYou can easily download Smartface App Studio, easily develop to cross-platform and easily get native output(s).","subtype":"SESSION","startTimestamp":1400240700,"webLink":"http://www.androiddeveloperdays.com/sessions/smartface-app-studio/","presenterIds":["736"],"endTimestamp":1400243400},{"id":"753","title":"7 Ways to Hang Yourself With Android (Security)","location":"47","description":"","subtype":"SESSION","startTimestamp":1400244300,"webLink":"http://www.androiddeveloperdays.com/sessions/to-be-determined-6/","presenterIds":["750"],"endTimestamp":1400247000},{"id":"754","title":"Be in control","location":"48","description":"Being in control of things matters. Especially in a professional development environment. This is why the use of a proper version control system is vital. In combination with build automation you can gain full control over the history and current state of your project.","subtype":"SESSION","startTimestamp":1400244300,"webLink":"http://www.androiddeveloperdays.com/sessions/be-in-control/","presenterIds":["711"],"endTimestamp":1400247000},{"id":"752","title":"Devoxx & JUG Best Practices","location":"46","description":"During this talk I will share my experiences & best practices from how to run a Java User Group to organise a conference like Devoxx and franchise it to multiple countries around Europe. In addition I will talk about Devoxx4Kids which is now rapidly growing into a world wide initiative for inspiring teenagers about (game) programming, robotics and electronics.","subtype":"SESSION","startTimestamp":1400244300,"webLink":"http://www.androiddeveloperdays.com/sessions/devoxx-jug-best-practices/","presenterIds":["749"],"endTimestamp":1400247000},{"id":"755","title":"Lazy Android Developer: Be productive","location":"49","description":"Android app development has become much more easier these days as compared to early days, reason being is the awesome android developer community with having awesome open source contributors and developers. With this, there are some libraries/tools exist which can ease our development easier, can design awesome UI, can help us to reduce boilerplate code and there by can help us to improve productivity for the android app development.\r\n\r\nSo during this talk, I will be exploring few such libraries/tools like Volley, Card UI, Crouton, Android annotation, Picasso and many others.","subtype":"SESSION","startTimestamp":1400244300,"webLink":"http://www.androiddeveloperdays.com/sessions/lazy-android-developer-be-productive/","presenterIds":["751"],"endTimestamp":1400247000},{"id":"767","title":"4:45 - A single test to rule them all","location":"49","description":"Last year I introduced you to the basics of the Page Object Pattern but this year we will climb the next step and see how exactly the same test code will run against a native android version of our simplified AUT. There are several ways you can automate native android apps but this time I will stick to the simplicity of selenium tests using selendroid and show you the tools and techniques you can use on your own applications. Why is it worth to put some effort in building stable regression suites that run automatically whenever you change something? I’ll tell you the secret at ADD14.","subtype":"SESSION","startTimestamp":1400247900,"webLink":"http://www.androiddeveloperdays.com/sessions/a-single-test-to-rule-them-all/","presenterIds":["761"],"endTimestamp":1400250600},{"id":"764","title":"4:45 - Reactive Programming on Android","location":"47","description":"It is always painful for developers to deal with concurrency through parallel exectutions in order to provide non blocking user interface. However, most applications (android & others) deal with these issues over and over again : fetching/writing data from/to network or storage, filtering and transforming this data, to finally displaying it to the user. Of course, this have to be done efficiently without introducing neither leak nor lock. Events based programming in an asynchronous environment will be presented in this session, using the Java implementation of MS Reactive Extentions.","subtype":"SESSION","startTimestamp":1400247900,"webLink":"http://www.androiddeveloperdays.com/sessions/reactive-programming-on-android/","presenterIds":["758"],"endTimestamp":1400250600},{"id":"768","title":"5:10 - Processes of Windows Phone Application Development","location":"49","description":"In this session, in addition to describing the required software and hardware tools for development in Windows Phone environment, publishing in the market and revenue models, also development processess of Sphero Robot Control Application will be described.","subtype":"SESSION","startTimestamp":1400247900,"webLink":"http://www.androiddeveloperdays.com/sessions/processes-of-windows-phone-application-development/","presenterIds":["762"],"endTimestamp":1400250600},{"id":"765","title":"5:10 - Robot Technology Overview and ARDUINO Programming","location":"47","description":"What is robot?\r\nWhere to use?\r\nIntroducing Arduino\r\nIntroducing Arduino IDE\r\nExample Arduino Project\r\nOther Arduino Projects","subtype":"SESSION","startTimestamp":1400247900,"webLink":"http://www.androiddeveloperdays.com/sessions/robot-technology-overview-and-arduino-programming/","presenterIds":["723"],"endTimestamp":1400250600},{"id":"763","title":"From Android App to Killer App: How to Reach the Million-Downloads Milestone","location":"46","description":"What makes an Android app a killer app? How do you make your own project scale from a few dozens to millions of users? How do you engage users all over the world? How do you put a spotlight on your app, so anyone can discover it? An Android app is not just what the app does, and it’s not just how you developed it. It’s about how you build an ecosystem around it. It’s about how do you improve your app to accommodate it to users, and how you make users comfortable with your app. It’s about how you listen to your customers to make it awesome. It’s going the extra-mile and transform an app from cool to magic. In this talk we will discuss some strategies to improve the impact of Android apps, from multiple points of view: from app development to code optimization, from basic graphical assets to awesome eye-candy UI, from catchy features to user deep engagement. We will see how using the latest features compares to backward compatibility regarding user impact and how social marketing strategies can help an Android app reach that million-downloads milestone.","subtype":"SESSION","startTimestamp":1400247900,"webLink":"http://www.androiddeveloperdays.com/sessions/from-android-app-to-killer-app-how-to-reach-the-million-downloads-milestone/","presenterIds":["757"],"endTimestamp":1400250600},{"id":"766","title":"Interview Patterns – Strategies for the technical interview.","location":"48","description":"What does Google, Amazon, and Microsoft look for in a candidate? In this session, learn preparation and presentation strategies to help you interview well, communicate effectively, and navigate the challenges of a technical interview. Who knows, someone might even be interviewed live on stage!","subtype":"SESSION","startTimestamp":1400247900,"webLink":"http://www.androiddeveloperdays.com/sessions/interview-patterns-strategies-for-the-technical-interview/","presenterIds":["760"],"endTimestamp":1400250600},{"id":"777","title":"Future of Payments","location":"46","description":"","subtype":"KEYNOTE","startTimestamp":1400310900,"webLink":"http://www.androiddeveloperdays.com/sessions/future-of-payments/","presenterIds":["716"],"endTimestamp":1400312700},{"id":"786","title":"11:00 - Magic of Android Custom Views","location":"49","description":"There are various UI views to create interfaces in Android Framework. Using this views is a starting point but it is not enough to create awesome things. Fourtunately, alternative methods are available! I mean understanding and extending the View class.\r\n\r\nIn this presentatin, I will give some Custom View samples. Some of them makes unpossible things be possible and some of them increase performance. If you want to be beyond the limits of ordinary, open to innovation and suprise your uses, this talk is for you.","subtype":"SESSION","startTimestamp":1400313600,"webLink":"http://www.androiddeveloperdays.com/sessions/magic-of-android-custom-views/","presenterIds":["781"],"endTimestamp":1400316300},{"id":"787","title":"11:25 - SpeechKit – “Speech recognition technologies”","location":"49","description":"Denis and Alexander will talk about the process of speech recognition and explain how the speech recognition technology works. Also much attention will be paid to voice-user interface and the use of speech recognition technology in mobile devices. Also we will announce Turkish Public SpeechKit at same time.","subtype":"SESSION","startTimestamp":1400313600,"webLink":"http://www.androiddeveloperdays.com/sessions/speechkit-speech-recognition-technologies/","presenterIds":["783","782"],"endTimestamp":1400316300},{"id":"784","title":"Graphical Magic","location":"46","description":"The android.graphics APIs contain some useful tools which enable us to perform some tricks more commonly associated with Photoshop or Gimp. It is not always possible to use such tools, particularly when images are being loaded dynamically from external sources. Mark Allison, author of http://blog.styling android.com, explores these APIs and shows you get some amazing results by dynamically altering images in your app using such tools as ColorMatrixColorFilter, PorterDuffColorFilter, and Renderscript.\r\n\r\nThis is aimed at Intermediate to Advanced developers, and will include live tweets to related articles during the presentation.","subtype":"SESSION","startTimestamp":1400313600,"webLink":"http://www.androiddeveloperdays.com/sessions/graphical-magic/","presenterIds":["779"],"endTimestamp":1400316300},{"id":"785","title":"New Nokia X family – how to port your Android app?","location":"48","description":"","subtype":"SESSION","startTimestamp":1400313600,"webLink":"http://www.androiddeveloperdays.com/sessions/new-nokia-x-family-how-to-port-your-android-app/","presenterIds":["780"],"endTimestamp":1400316300},{"id":"796","title":"12:00 - How WebGL enables the 3D world in our mobile phones ?","location":"49","description":"In this session key details of webgl technology will be briefly covered.\r\nThe main topics of the presentation will be:\r\n-What is WebGL and how we utilize this technology in web applications ?\r\n-How WebGL enables the 3D world in our browsers?\r\n-Three.js and How to ease the webgl development?\r\n-Other libraries and tools that help us create webgl based apps.\r\n-Is mobile world ready for webgl ?","subtype":"SESSION","startTimestamp":1400317200,"webLink":"http://www.androiddeveloperdays.com/sessions/how-webgl-enables-the-3d-world-in-our-mobile-phones/","presenterIds":["792"],"endTimestamp":1400319900},{"id":"797","title":"12:25 - Structured web apps with Dart","location":"49","description":"Google released a new programming language, Dart. Dart is a new way of web programming. Inheritance, object oriented\r\nand high security are main attributes of Dart. Dart can be compiled into Javascript meaning one can deploy dart apps right now.\r\nWhat I will be discussing about will be possible use cases of Dart, a simple introduction into Dart and building a simple\r\nweb app with Dart.","subtype":"SESSION","startTimestamp":1400317200,"webLink":"http://www.androiddeveloperdays.com/sessions/structured-web-apps-with-dart/","presenterIds":["793"],"endTimestamp":1400319900},{"id":"795","title":"Android Application Security for Developers","location":"47","description":"With the ever increasing usage of our mobile devices, security and privacy are topics of great importance.\r\nSecurity thus becomes an integral part of the development process for applications of various categories (including, but not limited to, finance, commerce, social, …)\r\nAs Android developers we need to make sure that our applications are secure and reliable, and that the data that is present on the device, or in transit to a server, is safe from prying eyes.\r\nThis sessions aims to give a concise overview of some best practices regarding the implementation of a secure Android app.","subtype":"SESSION","startTimestamp":1400317200,"webLink":"http://www.androiddeveloperdays.com/sessions/android-application-security-for-developers/","presenterIds":["791"],"endTimestamp":1400319900},{"id":"794","title":"CyanogenMod: An overview on building your own Android OS","location":"46","description":"CyanogenMod: An overview on building your own Android OS —- An introduction into CM/Inc and the project as a whole. Anatomy of a device bring up with code compilation and an overview of how to contribute back upstream to the project.","subtype":"SESSION","startTimestamp":1400317200,"webLink":"http://www.androiddeveloperdays.com/sessions/cyanogenmod-an-overview-on-building-your-own-android-os/","presenterIds":["789","790"],"endTimestamp":1400319900},{"id":"810","title":"1:45 - Game Development in Android","location":"49","description":"There are lots of components in game development. It is especially talked about graphic and audio in the presentation. Also there will be given information and clues to move the game developed for Android to other platforms.","subtype":"SESSION","startTimestamp":1400323500,"webLink":"http://www.androiddeveloperdays.com/sessions/game-development-in-android/","presenterIds":["804"],"endTimestamp":1400326200},{"id":"808","title":"1:45 - Introduction to the Gradle build system for Android","location":"48","description":"Introductory talk on the new Gradle-based build system for Android as well as migration hints to migrate from Eclipse to Android Studio (and Gradle).","subtype":"SESSION","startTimestamp":1400323500,"webLink":"http://www.androiddeveloperdays.com/sessions/introduction-to-the-gradle-build-system-for-android/","presenterIds":["802"],"endTimestamp":1400326200},{"id":"809","title":"2:10 - Chromecast and the future of Android TV","location":"48","description":"Google seems ready to try to take over the big screen again. Chromecast provides a unique way for developers to extend their apps with a second screen experience. This talk shows the inner bits and bolts of Chromecast and sheds light on Android’s deep connection with Chromecast.","subtype":"SESSION","startTimestamp":1400323500,"webLink":"http://www.androiddeveloperdays.com/sessions/chromecast-and-the-future-of-android-tv/","presenterIds":["803"],"endTimestamp":1400326200},{"id":"811","title":"2:10 - Stay home and play! – Getting Social with Google Play Games SDK","location":"49","description":"This talk will explain the possibilities and benefits of using the Google Play Games SDK introduced at Google I/O 2013 and show how to add social and usability features on a real world example.\r\n\r\nDeveloping games for mobile devices is certainly one of the most lucrative genres today. Just recently Google started to split the “Games” section of the Play Store into sub-catogries to account for the growing market in that area.\r\n\r\nIt’s already hard enough to come up with a fresh idea, make it look good and work on all the target devices. But adding social features like leaderboards, achievements and multiplayer features to compete with friends and offering an easy way to continue a game phone that you started on your tablet is what can catapult a good app to a great one. And all these features you can get for free with the Google Play Games SDK.","subtype":"SESSION","startTimestamp":1400323500,"webLink":"http://www.androiddeveloperdays.com/sessions/stay-home-and-play-getting-social-with-google-play-games-sdk/","presenterIds":["805"],"endTimestamp":1400326200},{"id":"806","title":"Android On Intel Platforms","location":"46","description":"Android devices running on Intel platforms are real from some time now.\r\nDiscover what Intel is doing in this space, what tools we offer and what it may mean for your apps if you’re using native libraries.","subtype":"SESSION","startTimestamp":1400323500,"webLink":"http://www.androiddeveloperdays.com/sessions/android-on-intel-platforms/","presenterIds":["800"],"endTimestamp":1400326200},{"id":"807","title":"indir.com Mobile App Rewards Ceremony","location":"47","description":"","subtype":"SESSION","startTimestamp":1400323500,"webLink":"http://www.androiddeveloperdays.com/sessions/indir-com-mobile-app-rewards-ceremony/","presenterIds":["801"],"endTimestamp":1400326200},{"id":"821","title":"2:45 - Mobile Usability and User Experience","location":"49","description":"It is about integrating the concept and technics of usability and user experience with mobile products and product developments process.","subtype":"SESSION","startTimestamp":1400327100,"webLink":"http://www.androiddeveloperdays.com/sessions/mobile-usability-and-user-experience/","presenterIds":["817"],"endTimestamp":1400329800},{"id":"822","title":"3:10 - Why nobody download my application?","location":"49","description":"We publish the application after developing it. After that, us and some friends downloaded it but nothing happens after that. You have been dealing for this application for 4-5 months with your team friends. There should be something wrong, also you do not have budget. What should you do for increase the rate of the downloads of your application?","subtype":"SESSION","startTimestamp":1400327100,"webLink":"http://www.androiddeveloperdays.com/sessions/why-nobody-download-my-application/","presenterIds":["801"],"endTimestamp":1400329800},{"id":"819","title":"A Practical Look Into Android App Performance","location":"47","description":"Bu sunumda uygulama performansını etkilyen faktorlere farklı noktalardan bakmaya çalışacağız. Donanım, Linux ve Android derinliklerine ineneceğiz ve aynı zamanda güç tüketimi, kullanıcımı deneyimi konularına değineceğiz. Ayrıca performans problemleri çözmeye yardımcı fonksiyonlardan ve en iyi pratiklerden de (best practices) bahsedeceğiz","subtype":"SESSION","startTimestamp":1400327100,"webLink":"http://www.androiddeveloperdays.com/sessions/a-practical-look-into-android-app-performance/","presenterIds":["816"],"endTimestamp":1400329800},{"id":"818","title":"Challenge or Temptation: Eclipse can build Glass Apps","location":"46","description":"The cool kid of app development is Google Glass. Early brave developers are already putting out software, experimenting with the new experience. Eclipse is up to the challenge! Whether you are building web based Glassware using the Google Mirror API, native Glass apps, or M2M, eclipse can do it. Add a few simple extensions and it will rock.\r\n\r\nThis talk will give you an overview of the early tools, and demo developing cool applications for the Glass.","subtype":"SESSION","startTimestamp":1400327100,"webLink":"http://www.androiddeveloperdays.com/sessions/challenge-or-temptation-eclipse-can-build-glass-apps/","presenterIds":["815"],"endTimestamp":1400329800},{"id":"820","title":"Workshop:Building Mobile Web UIs with Vaadin – 1 -","location":"48","description":"Vaadin is Java framework for rapid development of highly interactive HTML5-based web applications in a server-side environment. It abstracts the underlying document and state transfer technologies (DOM, AJAX, JSON), allowing web applications to be developed in Java following desktop application patterns and design. Vaadin leverages the full power of GWT, a Java to Javascript compiler making it possible to develop the entire web application stack and new client-side components without leaving the Java environment.\r\n\r\nIn the workshop, attendees will create a simple mobile application based on Vaadin and the Vaadin TouchKit add-on. The application will demonstrate the basics of developing a Vaadin application, how to use the Vaadin TouchKit add-on, and best practices for Vaadin applications and mobile application design.\r\n\r\nRequirements: Java programming skills, basic knowledge of Vaadin, Eclipse or another IDE with Vaadin plugin, Maven plugin, and Tomcat 7.","subtype":"SESSION","startTimestamp":1400327100,"webLink":"http://www.androiddeveloperdays.com/sessions/session-3/","presenterIds":["725"],"endTimestamp":1400329800},{"id":"828","title":"3:45 - Wearable Devices and Develop for Sony Smartwatch2","location":"47","description":"-What are the new generation mobile devices?\r\n-How are they inside ordinary life?\r\n-Future of wearable technologies\r\n- Say “Hello world” to Smart Watchs\r\n-Sony Smartwatch2 SDK\r\n-Not to hard to write code for smart watches’\r\n-Sony Smartwatch2 sample application","subtype":"SESSION","startTimestamp":1400330700,"webLink":"http://www.androiddeveloperdays.com/sessions/new-generation-mobile-devices/","presenterIds":["824"],"endTimestamp":1400333400},{"id":"829","title":"4:10 - Mobile Education and Gamification","location":"47","description":"Especially recently gamification theory which is talked about lots,is effects our lives in many fields.\r\nWhat is the role of gamification , which aims to increase motivation and active participation especially in the business world?\r\nHow the gamification can be positioned With the new mobile platforms and applications in Education.","subtype":"SESSION","startTimestamp":1400330700,"webLink":"http://www.androiddeveloperdays.com/sessions/mobile-education-and-gamification/","presenterIds":["825"],"endTimestamp":1400333400},{"id":"827","title":"Creating your own monetization mix","location":"46","description":"A lot of developers are struggling on monetizing their apps and games. This talk covers several most common methods of monetizing mobile apps, and exams the pros and cons of different methods with the insights and case studies from the Amazon Appstore. You will learn how to maximize your revenue from In-app purchasing, mobile ads, and how to create your own monetization mix combining different offers from Amazons including high eCPM ad networks, promotion consoles and mobile associate APIs.","subtype":"SESSION","startTimestamp":1400330700,"webLink":"http://www.androiddeveloperdays.com/sessions/creating-your-own-monetization-mix/","presenterIds":["823"],"endTimestamp":1400333400},{"id":"831","title":"Today’s Banking: App Development Processes in Mobile Banking","location":"49","description":"We see that fınance and banking sector has been changed dramatically in recent years by the increase of usage of mobil devices.\r\n\r\nUsers want to access their accounts, make transactions, pay their bills anytime and anywhere moreover with no security paranoia. Due to these requests, banks have a mission to support their users in all platforms by being very close the recent technology improvements.\r\n\r\nResult of fast changing technology and conditions is mobile app development teams, in banks, are working like a tech company and want to be the winner in the market competition\r\n\r\nWe would like to share the revolution story of banking by answering the question what the consequences of improvements in tech for finance sector are.\r\n\r\nHere are the topics in revolution story .\r\n\r\nBefore starting implementatin, requirements and framework structure are specificed in all three platforms li>\r\nSecurity specifications for banking industry are added to requirements.\r\nCommon structure for tablets and phones is established to maximize perfromance and minimize labor force\r\nOne of the advantage of native development is using tech improvements rapidly in mobile app.\r\nGetting to know the close atm and branches by using augmented reality in Windows Phone 8\r\nThe best example is banking app for android watches.\r\nApp is migrated to IOS 7 when the update is available in development process.\r\nSuccess of apps is measured by feedbacks of users.\r\nUser requests are implemented very quickly and postive feedbacks prove the success of the app.\r\nDifficulties we faced and best practices for technical problems.","subtype":"SESSION","startTimestamp":1400330700,"webLink":"http://www.androiddeveloperdays.com/sessions/todays-banking-app-development-processes-in-mobile-banking/","presenterIds":["826"],"endTimestamp":1400333400},{"id":"830","title":"Workshop:Building Mobile Web UIs with Vaadin – 2 -","location":"48","description":"Vaadin is Java framework for rapid development of highly interactive HTML5-based web applications in a server-side environment. It abstracts the underlying document and state transfer technologies (DOM, AJAX, JSON), allowing web applications to be developed in Java following desktop application patterns and design. Vaadin leverages the full power of GWT, a Java to Javascript compiler making it possible to develop the entire web application stack and new client-side components without leaving the Java environment.\r\n\r\nIn the workshop, attendees will create a simple mobile application based on Vaadin and the Vaadin TouchKit add-on. The application will demonstrate the basics of developing a Vaadin application, how to use the Vaadin TouchKit add-on, and best practices for Vaadin applications and mobile application design.\r\n\r\nRequirements: Java programming skills, basic knowledge of Vaadin, Eclipse or another IDE with Vaadin plugin, Maven plugin, and Tomcat 7.","subtype":"SESSION","startTimestamp":1400330700,"webLink":"http://www.androiddeveloperdays.com/sessions/workshopbuilding-mobile-web-uis-with-vaadin-2/","presenterIds":["725"],"endTimestamp":1400333400},{"id":"838","title":"4:45 - Android Custom ROM Development","location":"46","description":"1:Overall Architecture\r\n2:System Revision and Development\r\n3:Android Kernel Configuration\r\n4:System Startup\r\n5:Compile And Run(Emulator,Device)","subtype":"SESSION","startTimestamp":1400334300,"webLink":"http://www.androiddeveloperdays.com/sessions/android-custom-rom-development/","presenterIds":["832"],"endTimestamp":1400337000},{"id":"840","title":"4:45 - Mount & Blade & Android","location":"47","description":"The performance of mobile devices is better, the easier to develop games with better quality. In this presentation, we gonna talk about how we migrate Mount&Blade: Warband, one of the best apps in Turkey, to Android platform. In this projet, A PC game is migrated fully to Android platfrom with no missing items so that game industry and commentators appreciated that.\r\n\r\nWe gonna talk bout how was our roadmap for cross-platfrom development, OpenGL support, the problems about performance and compatibility, co-operation with NVIDIA and how to solve interface problems. We expect that this session is very helpfull for game developers especially for guys using Android NDK.","subtype":"SESSION","startTimestamp":1400334300,"webLink":"http://www.androiddeveloperdays.com/sessions/mountblade-android/","presenterIds":["834"],"endTimestamp":1400337000},{"id":"839","title":"5:10 - Developing User Sensitive Android Apps","location":"46","description":"User experience is at least as important as content of the application in mobile world. One of the key factor about that is making your app fast and fluent. In this presentation, we gonna show how to develop a highly efficient Android App in this presentation with samples.","subtype":"SESSION","startTimestamp":1400334300,"webLink":"http://www.androiddeveloperdays.com/sessions/developing-user-sensitive-android-apps/","presenterIds":["835","833"],"endTimestamp":1400337000},{"id":"841","title":"5:10 - Internet of Locations","location":"47","description":"To make mobile devices aware of the locations, placing bluetooth low energy based beacons and properties of SDK integrated with mobile apps.","subtype":"SESSION","startTimestamp":1400334300,"webLink":"http://www.androiddeveloperdays.com/sessions/internet-of-locations/","presenterIds":["836"],"endTimestamp":1400337000},{"id":"842","title":"ok glass play a game with…","location":"48","description":"Game development probably is one of the most challenging area of software engineering. With evolution of wearable devices like Google Glass it becomes even more interesting. This presentation is a quick walk thought glass games ideology, resources and sensors we can use and finally tools and frameworks suitable for building next generation games.\r\n\r\nPresentation will be interesting to everyone who make, want to make, like play games or simply interested in new piece of technology revolution.","subtype":"SESSION","startTimestamp":1400334300,"webLink":"http://www.androiddeveloperdays.com/sessions/to-be-determined-4/","presenterIds":["837"],"endTimestamp":1400337000}]}