{"presenters":[{"id":"789","bio":"Abhisek Devkota is the Community Manager and project manager for Cyanogen Inc., a new company formed by the co­founders of the largest aftermarket Operating System for Android devices ­ CyanogenMod. The CyanogenMod Project is an open­source distribution that is community driven and created in collaboration with volunteers around the world, with the goal to allow users to truly own their phone through customization, functionality and enhanced security over their personal data.\r\n\r\nAbhisek is a veteran of the consulting industry surrounding Washington, DC. Before joining Cyanogen Inc. he worked on implementation of Software as a Service solutions for various US government agencies and in his spare time, was himself a volunteer to the CyanogenMod project for 4 years.\r\n\r\nAbhisek is an avid fan of technology and open­source communities. He is especially interested in opening the more niche prosumer and enthusiast ideas to the average user, including the benefits of secure services and personal data management.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/abhisek.png","name":"Abhisek Devkota","publicPlusId":"","plusoneUrl":""},{"id":"790","bio":"Adam Farden is an English teacher in the Czech Republic but is also one of many community device maintainers for CyanogenMod. He became interested in CyanogenMod three years ago when he bought his first Android phone. Last year he started a degree in informatics because of his interest in Android. Today he helps maintain Sony devices and runs the FreeXperia Project website.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/adam.png","name":"Adam Farden","publicPlusId":"","plusoneUrl":""},{"id":"832","bio":"He entered to IT sector by C/C++ programming languages during his researches in Unix-Linux in 2002. He made programming in kernel level for Unix-Linux. Then he improved himself in .Net and Java technologies. He worked in private companies between 2005-2010 and between 2010-2012, he worked in abroad in e-government, telecom and mobile fields as a team leader and developer. Now, he is working in designing embedded systems and developing custom Android ROM for embedded systems for smartphones for Turkish and foreign componies. Furthermore, he produced online training content in Fatih project and still continues doing this. He is author of “JavaSE8″ and “İleri düzey Android” books published by Kodlab.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/resim1.jpg","name":"A.Kerim FIRAT","publicPlusId":"","plusoneUrl":""},{"id":"723","bio":"At Yandex Alexander has been managing the development of such products and services as Yandex.Store, Yandex.Metro and Yandex.Metrica for apps.\r\nPreviously he led a data-transmission network group at a telecommunications company. Alexander holds an engineer’s degree in computer security.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/Alexander-Kochubey-251x300.jpg","name":"Alexander Kochubey","publicPlusId":"","plusoneUrl":""},{"id":"783","bio":"Alexander has been working on client-side speech recognition at Yandex since 2012. Previously, he was developing tools for industrial equipment monitoring. Alexander has a PhD degree in mathematical modelling.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Alexander-Panin-1-200x300.jpg","name":"Alexander Panin","publicPlusId":"","plusoneUrl":""},{"id":"718","bio":"In 2009 Ali Derbane started developing Android software at a company called Itude Mobile. With a vibrant team of cool developers he has developed various applications for different industries like banking, pharmaceutical and logistics. While developing these apps lots of challenges arose. These challenges drive him to keep learning about the exciting world of Android. Blogging, hosting workshops and talking about the challenges and the solutions to these challenges gives him the opportunity to share his knowledge with the rest of the world.\r\nIn the last years Ali has presented at various events. Some of these events are Droidcon NL, Droidcon UK, GDG Bordj DevFest, Devoxx BE and Droidcon Italy.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/ali.png","name":"Ali Darbane","publicPlusId":"","plusoneUrl":""},{"id":"816","bio":"Originally from Turkey, a graduate of Dokuz Eylul University Department of Computer Engineering, Utku joined Sony Mobile in Sweden late of 2008. He spent last 3 years working on various performance related topics on Sony Mobile’s flagship Android phones. His main focus areas are performance, user experience, system programming, computer architectures and software stacks.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Utku-300x300.jpg","name":"Ali Utku Selen","publicPlusId":"","plusoneUrl":""},{"id":"759","bio":"I’m 16 years old TED College student.\r\nI play tennis,play guitar,investigate and develope some projects in my free time.\r\nI’m interested in technology since my childhood and I’m also programming for three years.\r\nI have focused on social networks and Robotics.\r\nI had a semester internship as software developer at Sebit and took a small part of developing process as the youngest intern of the company.\r\nAt the university, I’m planning to carry out my projects.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/photo.png","name":"Alper Kürşat ÜNVER","publicPlusId":"","plusoneUrl":""},{"id":"719","bio":"Al has been involved with development for nearly two decades, and with Android since its' public launch. He's founded two successful companies and worked with numerous others to help them develop their products and strategies.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/alsutton.png","name":"Al Sutton","publicPlusId":"","plusoneUrl":""},{"id":"701","bio":"Anna Aleryd is the Operational Lead Editor of Sony’s online developer portal Developer World, where she is responsible for content like articles and tutorials related to Sony’s SDKs, tools and services for developers. Anna has eight years of experience in the mobile business, and she loves the fast-changing and challenging atmosphere it provides.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Anna_Aleryd-207x300.jpg","name":"Anna Aleryd","publicPlusId":"","plusoneUrl":""},{"id":"727","bio":"Arkin Kol has been Country Director of Dolby Turkey since September 2012. He oversees all Dolby activities in Turkey.\r\nPreviously he was Vice President of Marketing & Sales Europe at Sony DADC in Austria. He trained as a mechanical engineer\r\nand has a Master degree in Business Management.\r\n","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/AKOL-Picture-200x300.jpg","name":"Arkin Kol","publicPlusId":"","plusoneUrl":""},{"id":"750","bio":"","thumbnailUrl":"","name":"Arnaud Monhon Bah","publicPlusId":"","plusoneUrl":""},{"id":"804","bio":"He studied METU Computer Engineering between 1996-2001. He took role as technical leader in Tubitak UEKAE, Meteksan Sistem, Katron Defence Space and Simulation Technologies and Huawai. He founded Gideros that is cross mobile game development tool with two dimension and it has users in more than 50 countries in the world. He is the founder of Gideros Mobile and technical leader. He is the writer of Computer Graphics(ISBN: 975 347 104 0) book published by Seçkin. Also he is one of the writer of “Üç Boyutlu Bilgisayar Grafikleri”(Computer graphics with three dimensions) and “Canlandırma (Animation)” topics in Türk Bilişim Ansiklopedisi (Turkish IT Encyclopedia)","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/atilim-300x250.png","name":"Atilim Cetin","publicPlusId":"","plusoneUrl":""},{"id":"780","bio":"","thumbnailUrl":"","name":"Attila Csipa","publicPlusId":"","plusoneUrl":""},{"id":"711","bio":"After moving to Berlin in 2009 Benjamin started developing Applications for Android. Shortly after that he became manager of the “GDG Android in Berlin” which holds monthly meetups. He has co-organized Android related community events such as “GTUG Community Weekend”, “Global Android Dev Camp” and “GDG DevFest”.\r\n\r\nDuring his studies of Business Computing he and his team developed the Guinness World Record setting Open Source App Blinkendroid.\r\nFurther Benjamin is the developer and maintainer of the Crouton library for Android.\r\n\r\nSince 2012 Benjamin is working as a Senior Software Developer at ImmobilienScout24.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/benjamin.png","name":"Benjamin Weiss","publicPlusId":"","plusoneUrl":""},{"id":"823","bio":"Cheng Luo is a Developer Evangelist at Amazon EU. Before joined Amazon EU as a Developer Evangelist, Cheng was the head of Developer Relations in Samsung Europe. He spends most of his time travelling and speaking at various events and conferences covers social and location services, HTML5, monetization and other topics. When not travelling, he enjoys prototyping applications for mobile devices and writing books. He co-authored three books: “Introduction to Bada“, “Tizen for Dummies” and “Professional Tizen Application Programming” published by Wiley. Prior to joining Samsung’s Developer Relations team, he was a researcher working on the Networking Protocol Design and Security projects funded by Nokia Research Centre in Finland. He has over a decade experience on designing and developing mobile applications for various platforms, including Maemo, Symbian, Bada, Tizen and Android. ","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/profile_ChengLuo-300x300.jpg","name":"Cheng Luo","publicPlusId":"","plusoneUrl":""},{"id":"760","bio":"Chris Tuttle has 17 years experience working at Microsoft in development, test, and candidate selection (interviewing) roles. He has interviewed over 2,000 candidates for Dev, Test, PM, DBA, DBE, and executive positions, and has met with 250+ managers to qualify 500+ positions at some of the top software companies in the world including Microsoft, Amazon, Orbitz, and Accenture. Come meet Chris Tuttle and hear him share his passion for the technical interview and the lessons he learned the hard way. Also, he shares his Google Glass with anyone asks. Just ask him!","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/chris-224x300.jpeg","name":"Chris Tuttle","publicPlusId":"","plusoneUrl":""},{"id":"782","bio":"Denis has been developing products and services, which employ speech recognition technology at Yandex since 2012. He is the founder of a startup for voice search for online or telephone services. Denis has an MBA degree in information technology management.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Denis-Filippov-1-254x300.jpg","name":"Denis Filippov","publicPlusId":"","plusoneUrl":""},{"id":"815","bio":"Naci is the Chief Scientist and founder of eteration a.s. He is an object mentor and an educator. Naci is the founder of ObjectLearn and in 2000 wrote ObjectWeb Lomboz™, an Open Source Software for JavaEE development. He is an active contributor to open source, the ObjectWeb Consortium and the Eclipse Foundation.\r\n\r\nPrior to eteration, Naci was with BEA Systems Inc. and The Object People as the Managing Director of Professional Services. With a strong foundation in Applied Engineering and Computational Physics, Naci received his Ph.D. from Carleton University, Ottawa, Canada. He is a member of the faculty at Sabanci University where he teaches object technologies, web development and distributed computing.\r\n\r\neteration is a member of the ObjectWeb Consortium and a member of the Eclispe Web Tools Platform Project (WTP), Project Management Committee. Naci is a member of the WTP PMC, representing ObjectWeb, and leads the Eclipse Java Standard Tools subproject. eteration is also a provider of tools, developer resources and server infrastructures to WTP project and contributes source training tools and courseware to the Eclipse Community Education Project (ECESIS).","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/naci.jpeg","name":"Dr. Naci Dai","publicPlusId":"","plusoneUrl":""},{"id":"824","bio":"Duygu Kahraman is an engineer having a passion for Android. She has worked as Android developer in R&D departments of various corparate companies. She has been in mobile industry since 2010 and worked as developer and team lead positions. She has given several seminars about mobile. Not only mobile devices, she is also interested in wearable devices has founded own startup and continues to develop own startup’s projects.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/profil-179x300.jpg","name":"Duygu Kahraman","publicPlusId":"","plusoneUrl":""},{"id":"738","bio":"Born in Istanbul, 1988. Graduated from Yildiz Technical University Mathematical Engineering program in 2010 and Information Technology program in Sabanci University. After graduation, she started to work as developer in Eteration A.Ş, İstanbul in 2012. She still works in Eteration as web and mobile developer. Her motivation depends on learning, achieving and understanding the hidden dynamics of almost every concept which is new and interesting for her.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Ecem_Dalgic_Photo-300x225.png","name":"Ecem Dalgıç","publicPlusId":"","plusoneUrl":""},{"id":"791","bio":"Filip Maelbrancke is a software consultant at AppFoundry in Belgium. He mainly works on Android projects in the financial services, telecom and media sectors as a developer and tech lead.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/filip_maelbrancke_add_photo-1-201x300.jpg","name":"Filip Maelbrancke","publicPlusId":"","plusoneUrl":""},{"id":"712","bio":"Hasan Hoşgel is a dedicated Android developer about ten years of professional programming of which more than three years have been in apps development.Continuous improvement of the architecture and also quality are his interest. He is also co-organizer of the “GDG Berlin Android”. Since 2006 Hasan working for ImmobilienScout24 as a Senior Developer.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/hasanhosgel.jpg","name":"Hasan Hoşgel","publicPlusId":"","plusoneUrl":""},{"id":"801","bio":"indir.com Founder and Partner.He is graduated from İstanbul Kültür üniversity department of computer engineering . He is sharing papers about enterpreneurship in his blog to share his experiences. Yaşar who is developing internet projects since 1999 is still partner and founder at indir.com and manages indir.com and oyna.com","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/hasan.png","name":"Hasan Yasar","publicPlusId":"","plusoneUrl":""},{"id":"707","bio":"Iordanis Giannakakis is a software engineer with eight years of experience on the full stack. Based in London, he is currently the Android team lead at Shazam, where he is trying to promote BDD and software craftsmanship to developers that share the same passion.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Iordanis_Giannakakis.jpg","name":"Iordanis Giannakakis","publicPlusId":"","plusoneUrl":""},{"id":"724","bio":"James Newnorth is all about software development and loves challenges. James is working as a hackathon community manager within the Developer Program at Sony, and has done everything from Commodore 64 to Android mobile phone development. He started out developing games at the age of 12 and has since then been programming almost every day, you can find him streaming code sessions online several times per week. His passion for Android ended up in wearable’s as he saw the potential for life improving software just around the corner in that area.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Bio-Photo.png","name":"James Newnorth","publicPlusId":"","plusoneUrl":""},{"id":"740","bio":"Co-founder & CEO Pollfish. John Papadakis studied Computer Engineering. More than 13 years programming experience. Previously founded Pajap Inc and now proud founder of Pollfish. Passionate with mobile platforms and businesses that scale.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/2a3b3f6-300x300.jpg","name":"John Papadakis","publicPlusId":"","plusoneUrl":""},{"id":"704","bio":"Android finally has established design guidelines and widely used UI design patterns. Android users understand functionality of components like the navigation drawer, action bar, sharing and many more. However, the guidelines are just that, guidelines, not rules. All Android apps should not look alike but neither should they all reinvent all the controls. In this presentation I want to take a deep dive into details of the common design patterns and how they can be customised without compromising usability. I want to help developers and designers alike to understand how to correctly use Android UI design patterns.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/luh.png","name":"Juhani Lehtimaki","publicPlusId":"","plusoneUrl":""},{"id":"757","bio":"Mario Viviani is an Android Developer since 2010. He has published more than 90 apps on Google Play. In 2011 Mario decided to create the startup Mariux Apps, based in Milan, Italy, focused on Mobile Applications Development. He’s member of Talent Garden, a network of co-working spaces focused on digital and innovation. As Mariux Apps his products received 12.000.000+ total downloads and are currently ranked in the Top 100 apps in a lot of Categories in Google Play. At Mariux Apps hes’s also working as Leap Motion developer, focusing on hand gestures-based UX. Mario is really active in the Android community, attending a lot of events worldwide, helping Android developers build new, compelling and well-received apps. He’s been nominated Google Developer Expert (GDE) for Android by Google in 2013.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/mario_glass-300x300.jpg","name":"Mario Viviani","publicPlusId":"","plusoneUrl":""},{"id":"779","bio":"The android.graphics APIs contain some useful tools which enable us to perform some be95c05a-864c-4c77-a543-6fd4b1fb8848tricks more commonly associated with Photoshop or Gimp. It is not always possible to use such tools, particularly when images are being loaded dynamically from external sources. Mark Allison, author of http://blog.styling android.com, explores these APIs and shows you get some amazing results by dynamically altering images in your app using such tools as ColorMatrixColorFilter, PorterDuffColorFilter, and Renderscript.\r\n\r\nThis is aimed at Intermediate to Advanced developers, and will include live tweets to related articles during the presentation.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/be95c05a-864c-4c77-a543-6fd4b1fb8848.png","name":"Mark Allison","publicPlusId":"","plusoneUrl":""},{"id":"802","bio":"I am a freelance Android developer from Germany. I started to develop Android apps right when I got my Motorola Milestone. It all started with an app where students at my university could rate and comment on the meals in the cafeteria. A lot of apps followed the success of this first app and I now have a couple of dozen apps in the Play Store (and other app stores) – ranging from some unsuccessful ideas to 1 million+ downloads apps. I am also an organizer of the GTUG Lake Constance and a frequent speaker at Android events.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/avatar-home-300x300.jpg","name":"Martin Liersch","publicPlusId":"","plusoneUrl":""},{"id":"825","bio":"Mehmet Sencer KARADAYI; a long-term student in Computer Engineering at METU loves games and works on gamification. He developed his first game in primary school and ruined his first business attempt when he was a freshman. He is also an active member of GDG Ankara, and one of oldies of IEEE METU. Nowadays, he continues his entrepreneurship adventures at ODTU Teknokent ATOM (Animation Technologies and Game Center).","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/1-222x300.png","name":"Mehmet Sencer Karadayı","publicPlusId":"","plusoneUrl":""},{"id":"761","bio":"Like usual around here, I’m a coding and technology freak. I finished my bachelor of engineering in computer science or on german “Dipl. Ing.” and most of the time I’m coding in Java. In my day job I work as a Software Engineer specialized on Automation and deal with all kind of Software from Native over Web into Mainframe where I use existing tools or write my own testing apps / libraries / frameworks. In the night I’m mostly focused on Android or other fast living technology.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/racic.jpg","name":"Michel Racic","publicPlusId":"","plusoneUrl":""},{"id":"762","bio":"He has been interested in computer technologies since primary school years and he started his studies with getting programming\r\nlanguage certificate from provincial directorate of national education.In 2008, he has been awarded his first Ph.D. degree on mathematical modeling and simulation in Turkey and in 2011 second Ph.D. degree on computer graphics in Switzerland. As a visiting researcher, he conducted some studies in Singapore and joined Microsoft Turkey in 2012. He works as director of Windows Phone Application\r\nDevelopment Unit.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/mustafakasap.png","name":"Mustafa Kasap","publicPlusId":"","plusoneUrl":""},{"id":"835","bio":"He started to work game development when he was in high school and he has been a professional game developer for 3 years. He has been working about making games cross-platform at TaleWorlds and he tries to develop something about game development in his free time.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/mustafa-200x300.jpg","name":"Mustafa Korkmaz","publicPlusId":"","plusoneUrl":""},{"id":"709","bio":"Having worked in the mobile industry for close to 10 years, Mustafa is a passionate leader and engineer with a strong focus on Agile software development. In the past he has worked in numerous countries and a range of industries including embedded devices, cryptography and core infrastructure components for high traffic web applications however recently he has continued his focus in the mobile industry working to build out the mobile applications and teams at the worlds largest social audio platform, SoundCloud","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/mustafa.jpg","name":"Mustafa Sezgin","publicPlusId":"","plusoneUrl":""},{"id":"737","bio":"Graduated from ITU Industrial Engineering. Primarily in the IT world, including Finance and Telecom, he took place in various enterprise software development project since 2000. He has been General Manager of OBSS Mobile as co-founder since 2012. He is also editor of http://www.iphoneturkey.com that started as hobby by him.\r\n","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/mtan.png","name":"Mustafa Tan","publicPlusId":"","plusoneUrl":""},{"id":"739","bio":"He was born in Kahramanmaraş in 1976. He went primary and high school in K.Maraş. He was graduated from Technical High School , electrics and electronics department. He started programming at the age of 15. He was graduated from computer engineering department from abroad, and ranked second. He did his Msc degree in Georgia State University in Marketing and Management department.\r\nHe continued his career in Dubai in 2001, worked as a manager on production of smart phones and regional sales for 5 years. He returned to Turkey and became general manager of General Mobile. He is the co-founder of General Mobile and because of his success, he ranked in high degrees in the list of “Promising managers under the age of 40″ made by Fortune Turkey Magazine in 2011 and 2012.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/genmob.jpg","name":"Muzaffer GÖLCÜ","publicPlusId":"","plusoneUrl":""},{"id":"736","bio":"He is interested in everything about operating systems, kernels and IT. Proudly member of Linux Foundation and works about mobile systems and is a contributor in Intel Software projects.\r\nWorking for Smartface as community manager.\r\nHe is the one of the developer of Automotive Grade Linux. Currently, working on SLP and presents his studies on various conferences.\r\nHe once took place in various Nokia projects.\r\nWorked as Community Manager at Turkcell Geleceği Yazanlar, which becomes Turkey’s biggest developer community.\r\nHe is still graduate student at Hacettepe University and Middle East Technical University.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/oytunz.png","name":"Oytun Şengul","publicPlusId":"","plusoneUrl":""},{"id":"751","bio":"Paresh is a mobile application developer with 4 years of apps development experience. Currently he is Sr. Software Engineer at InfoStretch Solutions Pvt. Ltd, India. He has been exploring android development since Android 1.5. His passion for Google Technologies brought him to lead GDG – Ahmedabad, India. He is very active in supporting Android developers community in India and worldwide be it through his tech blog “TechnoTalkative” http://www.technotalkative.com/ or through StackOverflow http://stackoverflow.com/users/379693/paresh-mayani","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/IMG_3199-1-211x300.jpg","name":"Paresh Mayani","publicPlusId":"","plusoneUrl":""},{"id":"741","bio":"Involved as organizer of the Brussels Google Technology User Group\r\n(BruGTUG), Pieter-Jan has brought extended hackathon formats, such as Global Android Dev Camp and V Hack Android, to European soil. He has been a “”professional”\" hobby developer of Android apps since the very start of the platform. Some of his code is part of open source Android (AOSP), and some is not, but he considers it to be no less useful.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/pieter.jpg","name":"Pieter-Jan Vandormael","publicPlusId":"","plusoneUrl":""},{"id":"836","bio":"Graduated from Istanbul Technical University, he has been working about mobile apps and embedded softwares for 3 years. He joined Boni as a Android app developer in June 2012, he take the responsibility of IOS developments in a short time. He took roles in BLE device design, embedded code of processor, protocol development for micro-location in iOS and Android devices. Recently, he has made Boni app compatible with BLE and prepared SDK to make Boni Beacons be used for other apps.\r\nHe has been working mobil apps and beacons(micro-location) tech at Boni","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/foto-252x300.jpg","name":"Rıza Özdülger","publicPlusId":"","plusoneUrl":""},{"id":"817","bio":"He works about usability, user experience, user interface and user interface development for izlesene.com, alkislarlayasiyorum.com, blogcu.com, sinemalar.com in nokta.com‘da as Design Expert. He also studies in Math and Computer deparment as a full scholarship student at Çankaya University","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/riza-selcuk-saydam-300x300.png","name":"Rıza Selcuk Saydam","publicPlusId":"","plusoneUrl":""},{"id":"781","bio":"I develop somethings on every mobile device. I am a fan and crazy about android. I am the mobile team lead for Metrekare.com venture. Working about Android, iPhone, iPad and Google Glass apps for Metrekare. Member of GDG Istanbul. I try not to miss any hackathon. Recently, being crazy about Google Glass","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/32-300x300.jpg","name":"Said Tahsin Dane","publicPlusId":"","plusoneUrl":""},{"id":"803","bio":"Sebastian Mauer is a Computer Science Student from Aachen. He is one of the Co-Leads of GDG Aachen and works as Software Architect at bitstars.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/DSC03251-1.jpg","name":"Sebastian Mauer","publicPlusId":"","plusoneUrl":""},{"id":"833","bio":"Serdar BİÇER is Co-Founder and CTO of Valven, which is operating in mobile industry. He has been developing and managing Java and JavaScript based web projects and Android applications since 2008. He holds BS and MS degrees from YTU and Bogazici University respectively. His PhD education in YTU Comp. Eng. has been on software quality.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/serdar_bicer-210x300.jpg","name":"Serdar Biçer","publicPlusId":"","plusoneUrl":""},{"id":"834","bio":"He has been working as a game engine developer at TaleWorlds since 2008. He got MSc degree about game technologies in 2012. He has focused on improving the graphic infrastructure and making optimizations for TaleWorld developed game engine. In addition, he also works about making game engine cross platform.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/serdar-200x300.jpg","name":"Serdar Koçdemir","publicPlusId":"","plusoneUrl":""},{"id":"805","bio":"Stefan Hoth is a software developer from Berlin, Germany. He’s an explorer of languages and always interested in learning new tricks. For more than 3 years now he’s building Android apps and is thrilled for the new possibilities SDKs like Google Cast and Android Wear will be offering.\r\n\r\nHe’s also a community organizer of many events and groups in Berlin, the GDG Berlin and Berlin Hack and Tell among them. To spread more tech knowledge he co-founded OpenTechSchool Berlin, a community-driven organisation offering free tech workshops for everyone which went international already with chapters around the globe.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/berliner.jpg","name":"Stefan Hoth","publicPlusId":"","plusoneUrl":""},{"id":"749","bio":"Stephan Janssen is a serial entrepreneur that has founded several successful organizations such as the Belgian Java User Group (BeJUG) in 1996, JCS Int. in 1998, Devoxx (aka JavaPolis) in 2001, Parleys.com in 2007 and recently co-founded Playpass.be.\r\n\r\nHe has been using Java since its early releases in 1995 with experience of developing and implementing real world Java solutions in the finance and manufacturing industries.\r\n\r\nSun has recognized in 2005 his efforts for the Java Community and has engaged Stephan in the Java Champion project.\r\n\r\nHe has spoken at numerous Java and JUG conferences around the world and recently received the JavaOne 2013 Rock Star speaker award.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/stephan.jpg","name":"Stephan Janssen","publicPlusId":"","plusoneUrl":""},{"id":"793","bio":"Şükrü Bezen, borned in June 16, 1987, graduated from METU Computer Engineering Department and he has been studying MSc in the same department. His thesis is about “Video Recommendation System” He is working as a software engineer at Labris Networks. He is curious about new technologies and algorithms. In addition, he take parts in the entreprenuer ecosystem  His project, Supportoad,  is one of the best fifteen project in Etohum 2014.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/936826_10152726222552715_1749010899_n-300x300.jpg","name":"Şükrü Bezen","publicPlusId":"","plusoneUrl":""},{"id":"693","bio":"","thumbnailUrl":"","name":"The Organisers","publicPlusId":"","plusoneUrl":""},{"id":"725","bio":"Thomas Mattsson He works at Vaadin as a Vaadin Expert and Project Manager. He has been designing and implementing Vaadin application architectures for over 5 years. When he isn’t designing, he runs around Europe doing Vaadin trainings and consulting gigs. You might also catch him on the Vaadin Forum.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/markmattshon1.png","name":"Thomas Mattsson","publicPlusId":"","plusoneUrl":""},{"id":"716","bio":"As a long time mobile and web developer, Tim channels his knowledge and experience as PayPal’s Lead Developer Evangelist in EMEA. He is passionate about startups and serves as mentor at multiple incubators and accelerators. Prior joining PayPal Tim used to work with Neofonie Mobile and Samsung focussing on several mobile projects. In his spare time, he leads and creates training classes in all sorts of developer-oriented topics, contributes to Open Source projects and is one of the authors of the Mobile Developer’s Guide to the Galaxy, as well as numerous articles published in print magazines.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/tim.png","name":"Tim Messerschmidt","publicPlusId":"","plusoneUrl":""},{"id":"758","bio":"Turhan OZ (@TurhanTech) is the founder and CEO of socosmoz.com, a lean startup company located in Paris, France. His entire effort and energy go to effectively bring value to people by creating high quality B2B and B2C android applications. Although having a solid technhical background, he is always looking for new pratices and technologies to improve himself, a life long quest for anyone taking development for serious. Highly convinced by the IoT era, he also creates connected devices to brave time and space constraints.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/t2.jpg","name":"Turhan Öz","publicPlusId":"","plusoneUrl":""},{"id":"826","bio":"He completed two-year degree at Marmara University Computer Programming Department, got BSc from Computer Engineering Department at East Mediterranean University, finally got MSc from Business Administration at Istanbul University.\r\n\r\nHe started his career as a product specialist at Index Computer in 2000. He continued his career as software developer in personal internet banking, corporate banking and call center departments at Akbank.\r\n\r\nHe started to work loyalty and mobile payment system Financial Apps Department at Innova IT Systems.\r\n\r\nHe worked as senior software engineer at Akbank IT Department in 2010. He focused on SMS systems, WAP ,IPAD banking and performance optimization.\r\n\r\nSince 2013, He has been working as Mobile Platforms App Development Manager responsible for iOS, Android, Windows 8 , Phone 8 and Mobile Web platforms.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Photo_Ugur-222x300.png","name":"Uğur Tadik","publicPlusId":"","plusoneUrl":""},{"id":"837","bio":"Mobile developer, Google Developers Group and Gamedev Community Lviv co-founder. Interested in GameDev, Android, iOS, Google App Engine and community management. Used to work for enterprise giants like EPAM as well as for product companies such as NRavo. Nowedays leading team focused on Unity 3D game engine.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/zasadnyy-228x300.jpg","name":"Vitaliy Zasadnyy","publicPlusId":"","plusoneUrl":""},{"id":"800","bio":"Xavier Hallade is Technical Marketing Engineer in Intel Software and Service Group (SSG) in Paris, France. He is helping developers improving their support for new hardware and technologies backed by Intel, with a focus on Wireless Displays and Native Development. Xavier has an engineer’s degree from ESIEA, Paris, France.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/03/xavier.png","name":"Xavier Hallade","publicPlusId":"","plusoneUrl":""},{"id":"792","bio":"Yağız, İstanbul’da ikamet eden bilgisayar mühendisi olup aynı zamanda oyun geliştirme ve interaktif konularında çalışan CodeModeOn firmasının kurucularındandır. Zorlu işler onu motive eder. Kodun tasarımla buluştuğu yerde onu bulabilirsiniz. Görselliği zengin ve interaktif uygulamalar gelişme konusunda oldukça heveslidir.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/YagizFoto-291x300.png","name":"Yağız Hatay","publicPlusId":"","plusoneUrl":""},{"id":"726","bio":"She has been graduated from Osmangazi University in 2003 and has Msc degree from Hacettepe University in 2006.\r\nhe is a member of GDG Ankara and software developer at Elektromed for since 2006.\r\nShe deals with developing software for embedded systems and test devices.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/resim-300x207.jpg","name":"Yasemin Can","publicPlusId":"","plusoneUrl":""},{"id":"710","bio":"Yinon Horwitz is in charge of the Business Development at StartApp, the leading global monetization & advertising mobile network.\r\nYinon advises leading global publishers, helping them tackle monetization, retention and distribution challenges.\r\nHe is a frequent speaker at conferences and seminars around the world focusing on monetization & maximizing value in the mobile arena.\r\nPrior to his position at StartApp, Yinon was an account manager at Kontera, advertising network which provides in-text contextual advertising and information services.\r\nAt Kontera, Yinon led & managed major advertisers’ accounts advising on strategy planning, optimization & execution of campaigns.","thumbnailUrl":"http://www.androiddeveloperdays.com/wp-content/uploads/2014/04/Yinon-300x199.jpg","name":"Yinon Horwitz","publicPlusId":"","plusoneUrl":""}]}